yaoyouzhong/esp8266-ai/firmware/src/main.cpp
// ESP8266 WiFi clock: shows local time plus live Claude Code / Codex CLI
// working status and usage quota, polled from a small bridge service that
// runs on the developer's Mac (see ../bridge/bridge.py).
//
// Display: 240x240 SPI ST7789 (TFT_eSPI). Pin mapping is set via build_flags
// in platformio.ini - edit those if your wiring differs.

#include <Arduino.h>
#include <ESP8266WiFi.h>
#include <ESP8266WebServer.h>
#include <ESP8266HTTPClient.h>
#include <WiFiClient.h>
#include <WiFiManager.h>
#include <LittleFS.h>
#include <ArduinoJson.h>
#include <TFT_eSPI.h>
#include <AnimatedGIF.h>

#include "config.h"
#include "img/claude_sprite.h"
#include "img/codex_sprite.h"
#include "img/claude_logo.h"
#include "img/codex_logo.h"

TFT_eSPI tft = TFT_eSPI();
ESP8266WebServer webServer(80);
WiFiManager wifiManager;

bool wifiPortalActive = false;
bool webServerStarted = false;
unsigned long wifiDisconnectedSinceMs = 0;
unsigned long lastWifiRetryMs = 0;
const unsigned long WIFI_PORTAL_DELAY_MS = 15000;
const unsigned long WIFI_RETRY_INTERVAL_MS = 30000;

// ---------- custom sprite storage (LittleFS) ----------
// Custom uploads replace the compiled-in default animation without needing a
// firmware rebuild. You POST a raw .gif straight to /sprite/claude or
// /sprite/codex (the device serves its own upload page at "/"); the ESP8266
// decodes and rescales the GIF *on-device* (AnimatedGIF, line-by-line so it
// never needs a full-canvas buffer) into the wire format below, which the
// display path then reads back frame-by-frame:
//   [1 byte frame count][frame0 bytes][frame1 bytes]...
// Each frame is exactly CLAUDE_SPRITE_W x H (or CODEX_SPRITE_W x H) RGB565
// pixels, byte order matching tools/convert_sprites.py's to_rgb565() so the
// compiled-in defaults and custom uploads share one draw path.
const char *CLAUDE_SPRITE_FILE = "/c.bin";
const char *CODEX_SPRITE_FILE = "/x.bin";
const char *CLAUDE_GIF_FILE = "/c.gif"; // raw upload, decoded then removed
const char *CODEX_GIF_FILE = "/x.gif";
const int MAX_CUSTOM_FRAMES = 8;
const size_t CLAUDE_FRAME_BYTES = (size_t)CLAUDE_SPRITE_W * CLAUDE_SPRITE_H * 2;
const size_t CODEX_FRAME_BYTES = (size_t)CODEX_SPRITE_W * CODEX_SPRITE_H * 2;

// We never hold a whole sprite frame in RAM. Decoding a GIF needs ~24KB of
// heap for AnimatedGIF's own buffers, which wouldn't fit alongside a static
// full-frame buffer (a 120x120 frame is ~28KB) on the ESP8266's ~80KB. So both
// the display path and the decoder work one screen-row at a time through these
// two small scratch rows (SCREEN_W is the widest we ever need).
uint16_t rowBuf[SCREEN_W];     // current row being drawn / decoded
uint16_t prevRowBuf[SCREEN_W]; // decode only: same row from the previous frame

bool claudeCustom = false;
int claudeCustomFrames = 0;
bool codexCustom = false;
int codexCustomFrames = 0;
uint32_t spriteRev = 0; // bumped on upload/reset so the Mac mirror re-fetches

const int SCREEN_CX = 120, SCREEN_CY = 120;
const int RING_MARGIN = 4;      // inset from screen edge
const int RING_THICKNESS = 10;  // ring bar thickness
const unsigned long ANIM_INTERVAL_MS = 120;  // sprite frame advance
const unsigned long FLASH_INTERVAL_MS = 400; // "urgent" flash speed
const unsigned long SWITCH_BOTH_MS = 2000;   // both apps working: alternate fast
const unsigned long SWITCH_IDLE_MS = 6000;   // neither working: alternate slow

enum ActiveApp { APP_CLAUDE, APP_CODEX };
ActiveApp currentApp = APP_CLAUDE;
unsigned long lastSwitchMs = 0;

// Display override, settable from the Mac app via POST /api/display:
// auto = follow working status, claude/codex = pin that app on screen,
// domestic/net/music/stock/weather = bridge-side pages; screensaver = moving clock.
enum DisplayMode { MODE_AUTO, MODE_CLAUDE, MODE_CODEX, MODE_DUAL, MODE_DOMESTIC, MODE_NET, MODE_MUSIC, MODE_STOCK, MODE_WEATHER, MODE_SCREENSAVER };
DisplayMode displayMode = MODE_AUTO;
DisplayMode effectiveMode();
bool screenSaverPreview = false;

const unsigned long COMPLETION_ALERT_MS = 2400;
unsigned long completionAlertUntilMs = 0;
bool completionFlashOn = false;
bool codexCompletionInitialized = false;

bool completionAlertActive() {
  return (long)(completionAlertUntilMs - millis()) > 0;
}

void startCodexCompletionAlert() {
  completionAlertUntilMs = millis() + COMPLETION_ALERT_MS;
  completionFlashOn = true;
  currentApp = APP_CODEX;
  lastSwitchMs = millis();
}

// When AUTO and the Mac reports audio playing, the screen auto-switches to the
// music page and back when it stops — same spirit as the Claude/Codex auto
// switch. Only AUTO does this; a pinned mode is always honored as-is.
bool statusMusicPlaying = false;
DisplayMode lastEffectiveMode = MODE_AUTO;
uint32_t bridgeEpochUtc = 0;
int bridgeUtcOffsetS = 0;
unsigned long bridgeClockSyncMs = 0;
int screenSaverOldX = -1, screenSaverOldY = -1, screenSaverOldW = 0, screenSaverOldH = 0;
long screenSaverLastTick = -1;

// 18x18 monochrome glyphs for 周日一二三四五六. The screen saver must remain
// usable without Wi-Fi, so its weekday cannot depend on a bridge bitmap.
const uint32_t WEEKDAY_GLYPHS[8][18] PROGMEM = {
  { 0x00000, 0x07FFC, 0x0630C, 0x0630C, 0x06FEC, 0x0630C, 0x0630C, 0x07FEC, 0x0600C, 0x0EFEC, 0x0EC6C, 0x0CC6C, 0x0CFEC, 0x0CC0C, 0x1C00C, 0x08078, 0x00000, 0x00000 },
  { 0x00000, 0x07FF8, 0x06018, 0x06018, 0x06018, 0x06018, 0x06018, 0x07FF8, 0x06018, 0x06018, 0x06018, 0x06018, 0x06018, 0x06018, 0x07FF8, 0x06018, 0x00000, 0x00000 },
  { 0x00000, 0x00000, 0x00000, 0x00000, 0x00000, 0x00000, 0x00000, 0x00000, 0x1FFFE, 0x00000, 0x00000, 0x00000, 0x00000, 0x00000, 0x00000, 0x00000, 0x00000, 0x00000 },
  { 0x00000, 0x00000, 0x07FF8, 0x00000, 0x00000, 0x00000, 0x00000, 0x00000, 0x00000, 0x00000, 0x00000, 0x00000, 0x00000, 0x1FFFE, 0x00000, 0x00000, 0x00000, 0x00000 },
  { 0x00000, 0x00000, 0x0FFFC, 0x00000, 0x00000, 0x00000, 0x00000, 0x00000, 0x07FF8, 0x00000, 0x00000, 0x00000, 0x00000, 0x00000, 0x1FFFE, 0x00000, 0x00000, 0x00000 },
  { 0x00000, 0x0FFFC, 0x0CCCC, 0x0CCCC, 0x0CCCC, 0x0CCCC, 0x0CCCC, 0x0CCCC, 0x0CCCC, 0x0CCCC, 0x0D8FC, 0x0F80C, 0x0C00C, 0x0FFFC, 0x0C00C, 0x00000, 0x00000, 0x00000 },
  { 0x00000, 0x0FFFC, 0x00E00, 0x00C00, 0x00C00, 0x00C00, 0x0FFF0, 0x01C30, 0x01C30, 0x01830, 0x01830, 0x01830, 0x01830, 0x01830, 0x1FFFE, 0x00000, 0x00000, 0x00000 },
  { 0x00300, 0x00700, 0x00380, 0x00300, 0x1FFFE, 0x00000, 0x00000, 0x01840, 0x01CE0, 0x03870, 0x03870, 0x07038, 0x0601C, 0x0E01C, 0x1C00E, 0x04008, 0x00000, 0x00000 },
};

// ---------- net speed mode state ----------
// Rendering is decoupled from the network: pollNet() fetches every 2s and
// only refills a queue of 250ms samples (the bridge samples at 4Hz and tags
// them with a running seq, so nothing is drawn twice or skipped). The sweep
// itself consumes exactly one queued sample every NET_DRAW_INTERVAL_MS, so
// the trace advances at a constant rate no matter how long HTTP takes.
const unsigned long NET_POLL_INTERVAL_MS = 2000; // queue refill cadence
const unsigned long NET_DRAW_INTERVAL_MS = 250;  // one chart step per bridge sample
const int NET_QUEUE = 32;
long netQRx[NET_QUEUE], netQTx[NET_QUEUE]; // ring buffer of pending samples
int netQHead = 0, netQCount = 0;
long netSeq = -1;                          // last bridge sample seq consumed into the queue
long netCurRx = 0, netCurTx = 0;           // smoothed readout for the header
int netCpuPct = 0, netMemPct = 0;
unsigned long lastNetPollMs = 0;
unsigned long lastNetDrawMs = 0;
bool netChromeDrawn = false;
bool netHeaderDirty = false;

// Chart layout (task-manager style scrolling area chart, newest at the right)
const int NET_CHART_X = 8, NET_CHART_Y = 60, NET_CHART_W = 224, NET_CHART_H = 128;
long netHistRx[NET_CHART_W], netHistTx[NET_CHART_W]; // one 250ms sample per column
long netScale = 10240;    // current "nice" full-scale value (whole chart shares it)
String netLastDl, netLastUl, netLastScaleText; // change detection for partial redraws
String netLastCpuVal, netLastMemVal;
bool netSysLabelsDrawn = false;

// ---------- music mode state ----------
const int MUSIC_COVER_W = 128;
const int MUSIC_COVER_H = 128;
// Title/artist come as a Mac-rendered bitmap strip (232x44) because the
// panel fonts are ASCII-only and CJK titles would render as blanks.
const int MUSIC_TEXT_W = 232;
const int MUSIC_TEXT_H = 44;
const int MUSIC_TEXT_X = 4, MUSIC_TEXT_Y = 150;
const unsigned long MUSIC_POLL_INTERVAL_MS = 2000;
String musicTitle, musicArtist, musicAlbum;
bool musicPlaying = false;
int musicElapsed = 0, musicDuration = 0;
int musicArtworkRev = -1;
int musicTextRev = -1;
bool musicHasArtwork = false;
bool musicChromeDrawn = false;
unsigned long lastMusicPollMs = 0;

// ---------- stock watchlist / weather clock state ----------
const unsigned long STOCK_POLL_INTERVAL_MS = 5000;
const int MAX_STOCKS = 4;
const int STOCK_NAME_W = 156, STOCK_NAME_H = 20;
struct StockRow { String code, price, pct; int up = 0; };
StockRow stocks[MAX_STOCKS];
int stockCount = 0;
int stockNamesRev = -1, stockNamesDrawnRev = -1;
bool stockEverLoaded = false, stockDirty = false, stockChromeDrawn = false;
String stockLastCode[MAX_STOCKS], stockLastValue[MAX_STOCKS];
unsigned long lastStockPollMs = 0;

const unsigned long WEATHER_POLL_INTERVAL_MS = 15000;
const int WEATHER_HEADER_W = 130, WEATHER_HEADER_H = 26;
const int WEATHER_DATE_W = 190, WEATHER_DATE_H = 30;
const int WEATHER_AIR_W = 42, WEATHER_AIR_H = 30;
const int WEATHER_CONTENT_LEFT = 14;
const int WEATHER_HEADER_Y = 1;
const int WEATHER_DATE_X = WEATHER_CONTENT_LEFT, WEATHER_DATE_Y = 117;
// Centre the air-quality badge in the visual gap between the header text and
// the weather icon. 132 placed its centre noticeably too far to the right.
// Keep the badge on the right side of the high/low row. It must not share
// horizontal space with longer header text such as "南京 毛毛雨".
const int WEATHER_AIR_X = 148, WEATHER_AIR_Y = 22;
const int WEATHER_ICON_X = 202, WEATHER_ICON_Y = 27;
const int WEATHER_ANIM_BOTTOM = 224;
struct WeatherStatus {
  float temp = 0, high = 0, low = 0, pm25 = -1;
  int humidity = 0, icon = -1, animation = 0, utcOffsetS = 0, textRev = -1, dateCenterX = WEATHER_DATE_W / 2, headerCenterX = WEATHER_HEADER_W / 2;
  uint32_t epochUtc = 0;
  bool stale = false, loaded = false;
};
WeatherStatus weatherStatus;
int weatherContentCenter() {
  return WEATHER_DATE_X + constrain(weatherStatus.dateCenterX, 0, WEATHER_DATE_W - 1);
}
int weatherHeaderX() { return WEATHER_DATE_X; }
int weatherHeaderCenter() {
  return weatherHeaderX() + constrain(weatherStatus.headerCenterX, 0, WEATHER_HEADER_W - 1);
}
int weatherTextDrawnRev = -1;
bool weatherChromeDrawn = false;
unsigned long weatherSyncMs = 0, lastWeatherPollMs = 0, lastWeatherClockMs = 0;
unsigned long lastWeatherAnimMs = 0;
int weatherAnimFrame = 0;
int weatherLastAnimation = -1;
int weatherLastHour = -1, weatherLastMinute = -1, weatherLastSecond = -1, weatherLastStale = -1;
void drawWeatherScreen(bool force);
void drawStockCachedOrLoading();
void drawWeatherCachedOrLoading();

int claudeFrame = 0;
int codexFrame = 0;
unsigned long lastAnimMs = 0;

bool flashOn = true;
unsigned long lastFlashMs = 0;

// Bridge host is not asked for during first-time WiFi setup: the Mac/Windows
// bridge discovers the device and pairs automatically (or set via /api/bridge).
String bridgeHost;

struct ClaudeStatus {
  String plan;
  String status = "unknown";
  long tokensToday = 0;
  int sessionMin = 0;
  int sessionWindowMin = 300;
  float fiveHourPct = -1; // real OAuth quota from the bridge, -1 = unknown
  int fiveHourResetMin = -1; // minutes until the 5h window resets
  float sevenDayPct = -1;
  int sevenDayResetMin = -1; // minutes until the 7-day window resets
  bool needsInput = false; // waiting on a permission/approval prompt
};

struct CodexStatus {
  String plan;
  String status = "unknown";
  long tokensToday = 0;
  float primaryPct = -1;
  int primaryResetMin = -1;
  float weeklyPct = -1;
  int weeklyResetMin = -1;
  bool needsInput = false;
  uint32_t completionAt = 0;
};

struct DomesticProviderStatus {
  String model;
  long tokensToday = 0;
  float planPct = -1;
  String planPctText;
  String remainingPctText;
  float fiveHourPct = -1;
  float weeklyPct = -1;
};

