yaoyouzhong/esp8266-ai/firmware/src/main.cpp
void syncCountdownDeadline() {
  int m = showingCd == CD_WEEK ? currentWeekResetMin() : currentHourResetMin();
  if (m < 0) {
    cdDeadlineMs = 0;
    return;
  }
  long bridgeSec = (long)m * 60 + 30; // bridge floors to minutes: assume mid-minute
  long ourSec = (long)(cdDeadlineMs - millis()) / 1000;
  if (cdDeadlineMs == 0 || cdApp != currentApp || cdAnchorType != showingCd || ourSec < 0 ||
      labs(ourSec - bridgeSec) > 90) {
    cdDeadlineMs = millis() + (unsigned long)bridgeSec * 1000UL;
    cdApp = currentApp;
    cdAnchorType = showingCd;
  }
}

void drawCountdown(bool force) {
  long remain = cdDeadlineMs ? (long)(cdDeadlineMs - millis()) / 1000
                             : (long)(showingCd == CD_WEEK ? currentWeekResetMin() : currentHourResetMin()) * 60;
  if (remain < 0) remain = 0;
  char buf[16];
  long hours = remain / 3600;
  if (hours >= 100) // weekly can be up to 168h: h:mm:ss wouldn't fit the ring
    snprintf(buf, sizeof(buf), "%ld:%02ld", hours, (remain % 3600) / 60);
  else
    snprintf(buf, sizeof(buf), "%ld:%02ld:%02ld", hours, (remain % 3600) / 60, remain % 60);
  String t(buf);
  if (!force && t == lastCountdown) return;
  // in-place glyph overwrite can't erase a shrinking string (h:mm:ss width is
  // constant, but 100:00 -> 99:59:59 changes layout once) - clear on any
  // length change
  if (t.length() != lastCountdown.length()) force = true;
  lastCountdown = t;
  tft.setTextDatum(TC_DATUM);
  if (force) {
    tft.fillRect(SCREEN_CX - 99, 66, 198, 84, TFT_BLACK);
    drawBoldString(showingCd == CD_WEEK ? "Wk RESET IN" : "5h RESET IN", SCREEN_CX, 72, 2, TFT_LIGHTGREY);
  }
  // Background-color draw overwrites glyphs in place (no clear-then-draw
  // flash between seconds).
  tft.setTextColor(TFT_ORANGE, TFT_BLACK);
  tft.drawString(t, SCREEN_CX, 102, 6);
}

// App logo in the top-left corner (inside the quota ring) so a glance tells
// which app the screen is currently showing. Drawn row-by-row from PROGMEM
// through rowBuf, same as the sprite path.
const int LOGO_X = 14, LOGO_Y = 18;

void drawAppLogo() {
  const uint16_t *logo = (currentApp == APP_CLAUDE) ? claude_logo_0 : codex_logo_0;
  int w = (currentApp == APP_CLAUDE) ? CLAUDE_LOGO_W : CODEX_LOGO_W;
  int h = (currentApp == APP_CLAUDE) ? CLAUDE_LOGO_H : CODEX_LOGO_H;
  for (int r = 0; r < h; r++) {
    memcpy_P(rowBuf, logo + (size_t)r * w, (size_t)w * 2);
    tft.pushImage(LOGO_X, LOGO_Y + r, w, 1, rowBuf);
  }
}

// Compact Claude + Codex quota overview. It reuses TFT_eSPI's built-in fonts
// and repaints only the section whose values changed, so status polling does
// not flash the whole screen.
String dualLastClaudeKey, dualLastCodexKey;

String quotaResetText(int minutes) {
  if (minutes < 0) return "";
  if (minutes >= 1440) return String(minutes / 1440) + "d" + String((minutes % 1440) / 60) + "h";
  if (minutes >= 60) return String(minutes / 60) + "h" + String(minutes % 60) + "m";
  return String(minutes) + "m";
}

uint16_t quotaBarColor(float pct) {
  if (pct >= 99.5f) return TFT_RED;
  if (pct >= 80) return TFT_YELLOW;
  return TFT_GREEN;
}

uint16_t dualPlanColor(const String &plan) {
  if (plan == "PRO" || plan == "PRO LITE" || plan == "MAX"
      || plan == "MAX 5X" || plan == "MAX 20X") return TFT_ORANGE;
  if (plan == "PLUS") return TFT_CYAN;
  if (plan == "TEAM" || plan == "BUSINESS" || plan == "ENTERPRISE") return TFT_MAGENTA;
  return TFT_LIGHTGREY;
}

void drawDualRow(const char *label, float pct, int resetMin, int y) {
  tft.setTextDatum(TL_DATUM);
  tft.setTextColor(0x7BEF, TFT_BLACK);
  tft.drawString(label, 20, y + 4, 2);
  tft.drawString(quotaResetText(resetMin), 54, y + 7, 1);
  tft.setTextDatum(TR_DATUM);
  tft.setTextColor(TFT_WHITE, TFT_BLACK);
  tft.drawString(pctText(pct), 220, y, 4);
  tft.fillRoundRect(20, y + 24, 200, 6, 3, 0x2104);
  if (pct >= 0) {
    int width = constrain((int)(200 * min(pct, 100.0f) / 100.0f), 0, 200);
    if (width > 0) tft.fillRoundRect(20, y + 24, width, 6, 3, quotaBarColor(pct));
  }
}

void drawDualSection(bool claude, bool force) {
  String plan = claude ? claudeStatus.plan : codexStatus.plan;
  String status = claude ? claudeStatus.status : codexStatus.status;
  float firstPct = claude ? claudeStatus.fiveHourPct : codexStatus.primaryPct;
  int firstReset = claude ? claudeStatus.fiveHourResetMin : codexStatus.primaryResetMin;
  float weekPct = claude ? claudeStatus.sevenDayPct : codexStatus.weeklyPct;
  int weekReset = claude ? claudeStatus.sevenDayResetMin : codexStatus.weeklyResetMin;
  bool single = !claude && firstPct < 0;
  String key = plan + "|" + status + "|" + String(firstPct, 1) + "|" + String(firstReset)
      + "|" + String(weekPct, 1) + "|" + String(weekReset) + "|" + String(single);
  String &lastKey = claude ? dualLastClaudeKey : dualLastCodexKey;
  if (!force && key == lastKey) return;
  lastKey = key;

  int top = claude ? 29 : 126;
  int height = claude ? 90 : 106;
  tft.fillRect(0, top, SCREEN_W, height, TFT_BLACK);
  uint16_t statusColor = status == "working" ? TFT_GREEN
      : status == "idle" ? TFT_YELLOW : 0x39E7;
  tft.fillCircle(18, top + 9, 4, statusColor);
  tft.setTextDatum(TL_DATUM);
  tft.setTextColor(claude ? TFT_ORANGE : TFT_CYAN, TFT_BLACK);
  drawBoldString(claude ? "CLAUDE" : "CODEX", 31, top, 2, claude ? TFT_ORANGE : TFT_CYAN);
  tft.setTextDatum(TR_DATUM);
  tft.setTextColor(dualPlanColor(plan), TFT_BLACK);
  tft.drawString(plan, 220, top + 2, 2);

  if (single) {
    drawDualRow("WK", weekPct, weekReset, top + 34);
  } else {
    drawDualRow("5H", firstPct, firstReset, top + 21);
    drawDualRow("WK", weekPct, weekReset, top + 54);
  }
}

void drawDualScreen(bool force = false) {
  if (force) {
    tft.fillScreen(TFT_BLACK);
    dualLastClaudeKey = "";
    dualLastCodexKey = "";
    tft.setTextDatum(TC_DATUM);
    drawBoldString("USAGE OVERVIEW", SCREEN_CX, 8, 2, TFT_WHITE);
    tft.drawFastHLine(18, 121, 204, 0x2945);
  }
  drawDualSection(true, force);
  drawDualSection(false, force);
}

String currentPlan() {
  return currentApp == APP_CLAUDE ? claudeStatus.plan : codexStatus.plan;
}

uint16_t planColor(const String &plan) {
  if (plan == "PRO" || plan == "PRO LITE") return TFT_ORANGE;
  if (plan == "PLUS") return TFT_CYAN;
  if (plan == "TEAM" || plan == "BUSINESS" || plan == "ENTERPRISE") return TFT_MAGENTA;
  if (plan == "MAX" || plan == "MAX 5X" || plan == "MAX 20X") return TFT_ORANGE;
  return TFT_LIGHTGREY;
}

