yaoyouzhong/esp8266-ai/firmware/src/main.cpp
  // axis label (outside the chart, so it never gets repainted over)
  String scaleText = speedText(netScale);
  if (scaleText != netLastScaleText) {
    netLastScaleText = scaleText;
    tft.fillRect(120, 48, 112, 10, TFT_BLACK);
    tft.setTextDatum(TR_DATUM);
    tft.setTextColor(0x7BEF, TFT_BLACK);
    tft.drawString(scaleText, NET_CHART_X + NET_CHART_W, 48, 1);
    tft.setTextDatum(TL_DATUM);
  }
}

// Chart tick, every NET_DRAW_INTERVAL_MS: shift in queued sample(s), then
// one atomic repaint. If the queue backs up after a slow poll, it works off
// up to three samples per tick until it's back in step.
void netDrawTick() {
  if (!netChromeDrawn) {
    resetNetChart();
    drawNetChrome();
    netChromeDrawn = true;
    netHeaderDirty = true;
  }
  if (netHeaderDirty) {
    drawNetHeaderIfChanged();
    drawNetSysinfoIfChanged();
    netHeaderDirty = false;
  }
  if (netQCount == 0) return;
  int steps = min(netQCount, netQCount > 16 ? 3 : 1);
  while (steps-- > 0 && netQCount > 0) {
    memmove(netHistRx, netHistRx + 1, sizeof(long) * (NET_CHART_W - 1));
    memmove(netHistTx, netHistTx + 1, sizeof(long) * (NET_CHART_W - 1));
    netHistRx[NET_CHART_W - 1] = netQRx[netQHead];
    netHistTx[NET_CHART_W - 1] = netQTx[netQHead];
    netQHead = (netQHead + 1) % NET_QUEUE;
    netQCount--;
  }
  drawNetChart();
}

// Refills the sample queue from the bridge's /net endpoint. The seq field
// tells us which samples we've already queued, so overlapping tails are fine.
bool applyNetJson(JsonObject doc) {
  netCurRx = doc["rx_bps"] | 0L;
  netCurTx = doc["tx_bps"] | 0L;
  netCpuPct = constrain(doc["cpu_pct"] | 0, 0, 100);
  netMemPct = constrain(doc["mem_pct"] | 0, 0, 100);
  netHeaderDirty = true;
  long seq = doc["seq"] | -1L;
  JsonArray rx = doc["rx"], tx = doc["tx"];
  int n = min(rx.size(), tx.size());
  int fresh = (netSeq < 0) ? min(n, 8) : (int)min((long)n, seq - netSeq);
  if (fresh < 0) fresh = 0;
  for (int i = n - fresh; i < n; i++) {
    if (netQCount >= NET_QUEUE) break;
    int tail = (netQHead + netQCount) % NET_QUEUE;
    netQRx[tail] = rx[i].as<long>();
    netQTx[tail] = tx[i].as<long>();
    netQCount++;
  }
  if (seq >= 0) netSeq = seq;
  return true;
}

String pctOrDash(float pct) {
  return pct >= 0 ? String((int)pct) + "%" : "--";
}

String fitDomesticText(String text, int maxWidth, int font) {
  while (text.length() > 0 && tft.textWidth(text, font) > maxWidth) {
    text.remove(text.length() - 1);
  }
  return text;
}

struct DomesticDrawCache {
  String provider;
  String model;
  String tokens;
  String plan;
  String remaining;
  bool initialized = false;
};

DomesticDrawCache domesticDrawCache;

void drawDomesticScreen(bool force = false) {
  const DomesticProviderStatus &p = domesticStatus.active;
  String provider = domesticStatus.activeProvider.length() ? domesticStatus.activeProvider : "qwen";
  provider.toUpperCase();
  String model = p.model.length() ? fitDomesticText(p.model, 112, 2) : "--";
  String tokens = formatTokens(p.tokensToday);
  String planNumber = p.planPct >= 0
      ? (p.planPctText.length() ? p.planPctText : String((int)p.planPct)) : "--";
  String plan = p.planPct >= 0 ? planNumber + "%" : "--";
  String remaining = p.planPct >= 0
      ? (p.remainingPctText.length() ? p.remainingPctText
          : String(floorf(max(0.0f, 100.0f - p.planPct) * 100.0f) / 100.0f, 2))
          + "% LEFT" : "QUOTA UNKNOWN";
  const uint16_t panelColor = 0x1082;
  const uint16_t mutedColor = 0x7BEF;
  const uint16_t numberColor = 0xFFDF;

  if (force) {
    tft.fillScreen(TFT_BLACK);
    ringLastPct = -1000;
    domesticDrawCache.initialized = false;
    tft.fillCircle(25, 30, 4, TFT_GREEN);
    tft.fillRect(20, 53, 200, 1, mutedColor);
    tft.fillRect(20, 53, 42, 1, TFT_GREEN);
    tft.fillRoundRect(20, 177, 200, 38, 8, panelColor);
    tft.drawRoundRect(20, 177, 200, 38, 8, 0x29A5);
    tft.setTextDatum(TL_DATUM);
    tft.setTextColor(TFT_GREEN, panelColor);
    tft.drawString("TODAY", 34, 184, 2);
    tft.setTextColor(mutedColor, panelColor);
    tft.drawString("TOKENS", 35, 201, 1);
    tft.setTextDatum(TC_DATUM);
    tft.setTextColor(mutedColor, TFT_BLACK);
    tft.drawString("PLAN", SCREEN_CX, 73, 1);
  }
  drawSquareRing(max(p.planPct, 0.0f), TFT_GREEN);
  if (force || !domesticDrawCache.initialized || provider != domesticDrawCache.provider) {
    tft.fillRect(34, 20, 72, 22, TFT_BLACK);
    tft.setTextDatum(TL_DATUM);
    drawBoldString(provider, 36, 24, 2, TFT_GREEN);
  }
  if (force || !domesticDrawCache.initialized || model != domesticDrawCache.model) {
    tft.fillRect(106, 20, 114, 22, TFT_BLACK);
    tft.setTextDatum(TR_DATUM);
    tft.setTextColor(TFT_LIGHTGREY, TFT_BLACK);
    tft.drawString(model, 218, 24, 2);
  }
  if (force || !domesticDrawCache.initialized || plan != domesticDrawCache.plan) {
    tft.fillRect(28, 90, 184, 54, TFT_BLACK);
    int numberFont = planNumber.length() <= 3 ? 7 : planNumber.length() <= 6 ? 4 : 2;
    int percentFont = numberFont == 7 ? 4 : 2;
    int numberY = numberFont == 7 ? 90 : numberFont == 4 ? 101 : 108;
    int percentY = numberFont == 7 ? 105 : numberFont == 4 ? 108 : 108;
    int numberWidth = tft.textWidth(planNumber, numberFont);
    int percentWidth = p.planPct >= 0 ? tft.textWidth("%", percentFont) : 0;
    int left = SCREEN_CX - (numberWidth + (percentWidth ? 4 + percentWidth : 0)) / 2;
    tft.setTextDatum(TL_DATUM);
    drawBoldString(planNumber, left, numberY, numberFont, numberColor);
    if (percentWidth) {
      tft.setTextColor(TFT_GREEN, TFT_BLACK);
      tft.drawString("%", left + numberWidth + 4, percentY, percentFont);
    }
  }
  if (force || !domesticDrawCache.initialized || remaining != domesticDrawCache.remaining) {
    tft.fillRect(30, 151, 180, 16, TFT_BLACK);
    tft.setTextDatum(TL_DATUM);
    tft.setTextColor(mutedColor, TFT_BLACK);
    tft.drawString("REMAINING", 37, 153, 1);
    tft.setTextDatum(TR_DATUM);
    tft.setTextColor(TFT_GREEN, TFT_BLACK);
    tft.drawString(remaining, 203, 151, 2);
  }
  if (force || !domesticDrawCache.initialized || tokens != domesticDrawCache.tokens) {
    tft.fillRect(104, 181, 101, 29, panelColor);
    tft.setTextDatum(TR_DATUM);
    tft.setTextColor(TFT_CYAN, panelColor);
    tft.drawString(tokens, 203, 184, 4);
  }
  domesticDrawCache.provider = provider;
  domesticDrawCache.model = model;
  domesticDrawCache.tokens = tokens;
  domesticDrawCache.plan = plan;
  domesticDrawCache.remaining = remaining;
  domesticDrawCache.initialized = true;
}

void pollNet() {
  if (usbBridgeActive()) return;
  if (WiFi.status() != WL_CONNECTED || bridgeHost.length() == 0) return;
  WiFiClient client;
  HTTPClient http;
  String url = "http://" + bridgeHost + "/net";
  http.setTimeout(BRIDGE_HTTP_TIMEOUT_MS);
  if (!http.begin(client, url)) return;
  int code = http.GET();
  if (code == HTTP_CODE_OK) {
    JsonDocument doc;
    if (!deserializeJson(doc, http.getString())) {
      applyNetJson(doc.as<JsonObject>());
    }
  }
  http.end();
}

String timeText(int sec) {
  if (sec < 0) sec = 0;
  char buf[12];
  snprintf(buf, sizeof(buf), "%d:%02d", sec / 60, sec % 60);
  return String(buf);
}

String fitText(String s, int maxPx, int font) {
  if (tft.textWidth(s, font) <= maxPx) return s;
  while (s.length() > 0 && tft.textWidth(s + "...", font) > maxPx) {
    s.remove(s.length() - 1);
  }
  return s + "...";
}

void drawMusicCoverPlaceholder() {
  const int x = (SCREEN_W - MUSIC_COVER_W) / 2;
  const int y = 14;
  tft.fillRect(x, y, MUSIC_COVER_W, MUSIC_COVER_H, TFT_DARKGREY);
  tft.drawRect(x, y, MUSIC_COVER_W, MUSIC_COVER_H, TFT_DARKGREY);
  tft.setTextDatum(MC_DATUM);
  tft.setTextColor(TFT_LIGHTGREY, TFT_DARKGREY);
  tft.drawString("No Art", SCREEN_CX, y + MUSIC_COVER_H / 2, 2);
}

bool drawMusicCoverFromBridge() {
  if (usbBridgeActive()) return false; // binary artwork remains WiFi-only in v1
  if (WiFi.status() != WL_CONNECTED || bridgeHost.length() == 0 || !musicHasArtwork) return false;
  WiFiClient client;
  HTTPClient http;
  String url = "http://" + bridgeHost + "/music/cover.raw";
  http.setTimeout(BRIDGE_HTTP_TIMEOUT_MS);
  if (!http.begin(client, url)) return false;
  int code = http.GET();
  if (code != HTTP_CODE_OK) {
    http.end();
    return false;
  }
  WiFiClient *stream = http.getStreamPtr();
  const int x = (SCREEN_W - MUSIC_COVER_W) / 2;
  const int y = 14;
  const size_t rowBytes = (size_t)MUSIC_COVER_W * 2;
  bool ok = true;
  for (int r = 0; r < MUSIC_COVER_H; r++) {
    int got = stream->readBytes((uint8_t *)rowBuf, rowBytes);
    if (got != (int)rowBytes) {
      ok = false;
      break;
    }
    tft.pushImage(x, y + r, MUSIC_COVER_W, 1, rowBuf);
    yield();
  }
  http.end();
  return ok;
}

// Streams the Mac-rendered 232x44 title/artist strip and blits it row by
// row — the only way to get CJK on screen without shipping a font.
bool drawMusicTextFromBridge() {
  if (usbBridgeActive()) return false; // use the metadata fallback over USB
  if (WiFi.status() != WL_CONNECTED || bridgeHost.length() == 0) return false;
  WiFiClient client;
  HTTPClient http;
  String url = "http://" + bridgeHost + "/music/text.raw";
  http.setTimeout(BRIDGE_HTTP_TIMEOUT_MS);
  if (!http.begin(client, url)) return false;
  int code = http.GET();
  if (code != HTTP_CODE_OK) {
    http.end();
    return false;
  }
  WiFiClient *stream = http.getStreamPtr();
  const size_t rowBytes = (size_t)MUSIC_TEXT_W * 2;
  bool ok = true;
  for (int r = 0; r < MUSIC_TEXT_H; r++) {
    int got = stream->readBytes((uint8_t *)rowBuf, rowBytes);
    if (got != (int)rowBytes) {
      ok = false;
      break;
    }
    tft.pushImage(MUSIC_TEXT_X, MUSIC_TEXT_Y + r, MUSIC_TEXT_W, 1, rowBuf);
    yield();
  }
  http.end();
  return ok;
}

// ASCII-only fallback if the strip fetch fails (CJK will stay blank, but at
// least latin titles show something).
void drawMusicTextFallback() {
  tft.fillRect(MUSIC_TEXT_X, MUSIC_TEXT_Y, MUSIC_TEXT_W, MUSIC_TEXT_H, TFT_BLACK);
  tft.setTextDatum(TC_DATUM);
  tft.setTextColor(TFT_WHITE, TFT_BLACK);
  String title = musicTitle.length() ? musicTitle : "No Music";
  tft.drawString(fitText(title, 216, 2), SCREEN_CX, MUSIC_TEXT_Y + 4, 2);
  tft.setTextColor(TFT_LIGHTGREY, TFT_BLACK);
  tft.drawString(fitText(musicArtist, 216, 2), SCREEN_CX, MUSIC_TEXT_Y + 24, 2);
}

// Regions repaint independently: cover / text strip only when their rev
// changes, progress bar + time on every poll (partial fill, no flicker
// elsewhere).
void drawMusicScreen(bool coverChanged, bool textChanged) {
  if (!musicChromeDrawn) {
    tft.fillScreen(TFT_BLACK);
    coverChanged = true;
    textChanged = true;
    musicChromeDrawn = true;
  }
  if (coverChanged) {
    if (!drawMusicCoverFromBridge()) drawMusicCoverPlaceholder();
  }
  if (textChanged) {
    if (!drawMusicTextFromBridge()) drawMusicTextFallback();
  }

  const int bx = 20, by = 204, bw = 200, bh = 8;
  tft.fillRect(0, by - 2, SCREEN_W, SCREEN_H - by + 2, TFT_BLACK);
  tft.fillRect(bx, by, bw, bh, TFT_DARKGREY);
  float progress = musicDuration > 0 ? (float)musicElapsed / (float)musicDuration : 0;
  if (progress < 0) progress = 0;
  if (progress > 1) progress = 1;
  uint16_t color = musicPlaying ? TFT_GREEN : TFT_LIGHTGREY;
  tft.fillRect(bx, by, (int)(bw * progress), bh, color);
  tft.setTextDatum(TC_DATUM);
  tft.setTextColor(TFT_LIGHTGREY, TFT_BLACK);
  tft.drawString(timeText(musicElapsed) + " / " + timeText(musicDuration), SCREEN_CX, 220, 1);
}

void applyMusicJson(JsonObject doc) {
  musicTitle = doc["title"] | "";
  musicArtist = doc["artist"] | "";
  musicAlbum = doc["album"] | "";
  musicPlaying = doc["playing"] | false;
  statusMusicPlaying = musicPlaying;
  musicElapsed = doc["elapsed"] | 0;
  musicDuration = doc["duration"] | 0;
  musicHasArtwork = doc["has_artwork"] | false;
  int rev = doc["artwork_rev"] | -1;
  bool coverChanged = rev != musicArtworkRev;
  musicArtworkRev = rev;
  int tRev = doc["text_rev"] | -1;
  bool textChanged = tRev != musicTextRev;
  musicTextRev = tRev;
  if (effectiveMode() == MODE_MUSIC) drawMusicScreen(coverChanged, textChanged);
}

void pollMusic() {
  if (usbBridgeActive()) return;
  if (WiFi.status() != WL_CONNECTED || bridgeHost.length() == 0) return;
  WiFiClient client;
  HTTPClient http;
  String url = "http://" + bridgeHost + "/music";
  http.setTimeout(BRIDGE_HTTP_TIMEOUT_MS);
  if (!http.begin(client, url)) return;
  int code = http.GET();
  if (code == HTTP_CODE_OK) {
    JsonDocument doc;
    if (!deserializeJson(doc, http.getString())) {
      applyMusicJson(doc.as<JsonObject>());
    }
  }
  http.end();
}

// ---------- stock watchlist ----------

