yaoyouzhong/esp8266-ai/firmware/src/main.cpp
bool applyStockJson(JsonObject doc) {
  JsonArray rows = doc["stocks"];
  stockCount = 0;
  for (JsonObject row : rows) {
    if (stockCount >= MAX_STOCKS) break;
    stocks[stockCount].code = row["code"] | "";
    stocks[stockCount].price = row["price"] | "";
    stocks[stockCount].pct = row["pct"] | "";
    stocks[stockCount].up = row["up"] | 0;
    stockCount++;
  }
  stockNamesRev = doc["names_rev"] | -1;
  stockEverLoaded = true;
  stockDirty = true;
  return true;
}

void pollStock() {
  if (usbBridgeActive() || WiFi.status() != WL_CONNECTED || bridgeHost.length() == 0) return;
  WiFiClient client;
  HTTPClient http;
  if (!http.begin(client, "http://" + bridgeHost + "/stock")) return;
  http.setTimeout(BRIDGE_HTTP_TIMEOUT_MS);
  if (http.GET() == HTTP_CODE_OK) {
    JsonDocument doc;
    if (!deserializeJson(doc, http.getString())) applyStockJson(doc.as<JsonObject>());
  }
  http.end();
}

bool drawStockNamesFromBridge() {
  if (WiFi.status() != WL_CONNECTED || bridgeHost.length() == 0) return false;
  WiFiClient client;
  HTTPClient http;
  if (!http.begin(client, "http://" + bridgeHost + "/stock/names.raw")) return false;
  http.setTimeout(BRIDGE_HTTP_TIMEOUT_MS);
  if (http.GET() != HTTP_CODE_OK) { http.end(); return false; }
  WiFiClient *stream = http.getStreamPtr();
  bool ok = true;
  const size_t rowBytes = (size_t)STOCK_NAME_W * 2;
  for (int stock = 0; stock < MAX_STOCKS && ok; stock++) {
    for (int row = 0; row < STOCK_NAME_H; row++) {
      if (stream->readBytes((uint8_t *)rowBuf, rowBytes) != (int)rowBytes) { ok = false; break; }
      if (effectiveMode() == MODE_STOCK && stock < stockCount)
        tft.pushImage(70, 6 + stock * 54 + row, STOCK_NAME_W, 1, rowBuf);
      yield();
    }
  }
  http.end();
  return ok;
}

void drawStockScreen(bool force = false) {
  if (force || !stockChromeDrawn) {
    tft.fillScreen(TFT_BLACK);
    stockChromeDrawn = true;
    stockNamesDrawnRev = -1;
    for (int i = 0; i < MAX_STOCKS; i++) { stockLastCode[i] = "\x01"; stockLastValue[i] = "\x01"; }
    tft.setTextDatum(TC_DATUM);
    tft.setTextColor(TFT_DARKGREY, TFT_BLACK);
    tft.drawString("STOCKS", SCREEN_CX, 228, 1);
  }
  stockDirty = false;
  if (stockCount == 0) {
    tft.fillRect(0, 0, SCREEN_W, 220, TFT_BLACK);
    tft.setTextDatum(TC_DATUM);
    tft.setTextColor(TFT_LIGHTGREY, TFT_BLACK);
    tft.drawString(stockEverLoaded ? "No valid quotes" : "Waiting for bridge...", SCREEN_CX, 104, 2);
    return;
  }
  for (int i = 0; i < MAX_STOCKS; i++) {
    int y = 6 + i * 54;
    bool has = i < stockCount;
    String code = has ? stocks[i].code : "";
    if (code != stockLastCode[i]) {
      stockLastCode[i] = code;
      stockNamesDrawnRev = -1;
      tft.fillRect(0, y, SCREEN_W, 17, TFT_BLACK);
      if (has) { tft.setTextDatum(TL_DATUM); tft.setTextColor(TFT_DARKGREY, TFT_BLACK); tft.drawString(code, 14, y, 2); }
    }
    String value = has ? stocks[i].price + "|" + stocks[i].pct + "|" + String(stocks[i].up) : "";
    if (value != stockLastValue[i]) {
      stockLastValue[i] = value;
      tft.fillRect(0, y + 21, SCREEN_W, 33, TFT_BLACK);
      if (has) {
        tft.setTextDatum(TL_DATUM); tft.setTextColor(TFT_WHITE, TFT_BLACK);
        tft.drawString(stocks[i].price, 14, y + 22, 4);
        uint16_t color = stocks[i].up > 0 ? TFT_RED : stocks[i].up < 0 ? TFT_GREEN : TFT_LIGHTGREY;
        tft.setTextDatum(TR_DATUM); tft.setTextColor(color, TFT_BLACK);
        tft.drawString(stocks[i].pct, 226, y + 22, 4);
      }
    }
  }
  if (!usbBridgeActive() && stockNamesRev >= 0 && stockNamesDrawnRev != stockNamesRev && drawStockNamesFromBridge())
    stockNamesDrawnRev = stockNamesRev;
}

// ---------- weather clock ----------

bool applyWeatherJson(JsonObject doc) {
  weatherStatus.temp = doc["temp"] | 0.0f;
  weatherStatus.high = doc["high"] | 0.0f;
  weatherStatus.low = doc["low"] | 0.0f;
  weatherStatus.pm25 = doc["pm25"] | -1.0f;
  weatherStatus.humidity = doc["humidity"] | 0;
  weatherStatus.icon = doc["icon"] | -1;
  String animation = doc["animation"] | "robot";
  weatherStatus.animation = animation == "house" ? 1 : animation == "plant" ? 2
    : animation == "off" ? 3 : animation == "pet" ? 4 : 0;
  weatherStatus.epochUtc = doc["epoch_utc"] | 0UL;
  weatherStatus.utcOffsetS = doc["utc_offset_s"] | 0;
  weatherStatus.stale = doc["stale"] | false;
  weatherStatus.textRev = doc["text_rev"] | -1;
  weatherStatus.dateCenterX = doc["date_center_x"] | (WEATHER_DATE_W / 2);
  weatherStatus.headerCenterX = doc["header_center_x"] | (WEATHER_HEADER_W / 2);
  weatherStatus.loaded = weatherStatus.epochUtc > 0;
  weatherSyncMs = millis();
  if (effectiveMode() == MODE_WEATHER) drawWeatherScreen(false);
  return weatherStatus.loaded;
}

void pollWeather() {
  if (usbBridgeActive() || WiFi.status() != WL_CONNECTED || bridgeHost.length() == 0) return;
  WiFiClient client;
  HTTPClient http;
  if (!http.begin(client, "http://" + bridgeHost + "/weather")) return;
  http.setTimeout(BRIDGE_HTTP_TIMEOUT_MS);
  if (http.GET() == HTTP_CODE_OK) {
    JsonDocument doc;
    if (!deserializeJson(doc, http.getString())) applyWeatherJson(doc.as<JsonObject>());
  }
  http.end();
}

bool drawWeatherLabelFromBridge(const char *path, int width, int height, int x, int y) {
  if (WiFi.status() != WL_CONNECTED || bridgeHost.length() == 0) return false;
  WiFiClient client;
  HTTPClient http;
  if (!http.begin(client, "http://" + bridgeHost + path)) return false;
  http.setTimeout(BRIDGE_HTTP_TIMEOUT_MS);
  if (http.GET() != HTTP_CODE_OK) { http.end(); return false; }
  WiFiClient *stream = http.getStreamPtr();
  const size_t rowBytes = (size_t)width * 2;
  bool ok = true;
  for (int row = 0; row < height; row++) {
    if (stream->readBytes((uint8_t *)rowBuf, rowBytes) != (int)rowBytes) { ok = false; break; }
    if (effectiveMode() == MODE_WEATHER) tft.pushImage(x, y + row, width, 1, rowBuf);
    yield();
  }
  http.end();
  return ok;
}

bool drawWeatherHeaderFromBridge() {
  tft.fillRect(0, 0, 192, 28, TFT_BLACK);
  return drawWeatherLabelFromBridge("/weather/header.raw", WEATHER_HEADER_W, WEATHER_HEADER_H, weatherHeaderX(), WEATHER_HEADER_Y);
}

bool drawWeatherDateFromBridge() {
  return drawWeatherLabelFromBridge("/weather/date.raw", WEATHER_DATE_W, WEATHER_DATE_H, WEATHER_DATE_X, WEATHER_DATE_Y);
}

