yaoyouzhong/esp8266-ai/firmware/src/main.cpp
bool drawWeatherAirFromBridge() {
  return drawWeatherLabelFromBridge("/weather/air.raw", WEATHER_AIR_W, WEATHER_AIR_H, WEATHER_AIR_X, WEATHER_AIR_Y);
}

void drawWeatherIcon(int x, int y, int icon) {
  if (icon == 0 || icon == 1) {
    tft.fillCircle(x, y, 10, TFT_YELLOW);
    for (int i = 0; i < 8; i++) {
      float a = i * 0.785f;
      tft.drawLine(x + (int)(cos(a) * 14), y + (int)(sin(a) * 14), x + (int)(cos(a) * 19), y + (int)(sin(a) * 19), TFT_YELLOW);
    }
  }
  if (icon == 1 || icon == 2 || icon == 4 || icon == 6) {
    tft.fillCircle(x - 8, y + 4, 8, TFT_LIGHTGREY); tft.fillCircle(x + 2, y, 11, TFT_LIGHTGREY); tft.fillCircle(x + 12, y + 5, 7, TFT_LIGHTGREY);
    tft.fillRect(x - 16, y + 4, 36, 9, TFT_LIGHTGREY);
  }
  if (icon == 3) { tft.drawCircle(x, y, 13, TFT_LIGHTGREY); tft.drawCircle(x + 5, y - 5, 10, TFT_LIGHTGREY); }
  if (icon == 4 || icon == 6) for (int i = -10; i <= 12; i += 11) tft.drawLine(x + i, y + 18, x + i - 3, y + 27, TFT_CYAN);
  if (icon == 5) for (int i = -10; i <= 12; i += 11) { tft.drawLine(x + i, y + 18, x + i - 3, y + 24, TFT_WHITE); tft.drawLine(x + i - 3, y + 18, x + i, y + 24, TFT_WHITE); }
  if (icon == 6) { tft.drawLine(x + 2, y + 15, x - 4, y + 27, TFT_YELLOW); tft.drawLine(x - 4, y + 27, x + 2, y + 25, TFT_YELLOW); }
}

void epochToLocal(uint32_t utc, int offset, int &year, int &month, int &day, int &hour, int &minute, int &second, int &weekday) {
  int64_t total = (int64_t)utc + offset;
  int64_t days = total / 86400;
  int64_t rest = total % 86400;
  if (rest < 0) { rest += 86400; days--; }
  hour = rest / 3600; minute = (rest % 3600) / 60; second = rest % 60;
  weekday = (int)((days + 4) % 7); if (weekday < 0) weekday += 7;
  int64_t z = days + 719468;
  int era = (z >= 0 ? z : z - 146096) / 146097;
  unsigned doe = (unsigned)(z - era * 146097);
  unsigned yoe = (doe - doe / 1460 + doe / 36524 - doe / 146096) / 365;
  year = (int)yoe + era * 400;
  unsigned doy = doe - (365 * yoe + yoe / 4 - yoe / 100);
  unsigned mp = (5 * doy + 2) / 153;
  day = doy - (153 * mp + 2) / 5 + 1;
  month = mp + (mp < 10 ? 3 : -9);
  year += month <= 2;
}

uint32_t currentBridgeUtc() {
  if (bridgeEpochUtc > 0) return bridgeEpochUtc + (millis() - bridgeClockSyncMs) / 1000;
  if (weatherStatus.loaded) return weatherStatus.epochUtc + (millis() - weatherSyncMs) / 1000;
  return 0;
}

void drawWeekdayGlyph(int glyph, int x, int y, uint16_t color) {
  for (int row = 0; row < 18; row++) {
    uint32_t mask = pgm_read_dword(&WEEKDAY_GLYPHS[glyph][row]);
    int runStart = -1;
    for (int col = 0; col <= 18; col++) {
      bool set = col < 18 && (mask & (1UL << (17 - col)));
      if (set && runStart < 0) runStart = col;
      if (!set && runStart >= 0) {
        tft.fillRect(x + runStart, y + row, col - runStart, 1, color);
        runStart = -1;
      }
    }
  }
}

void drawScreenSaverDigit(int digit, int x, int y, uint16_t color) {
  static const uint8_t masks[10] = { 0x3f, 0x06, 0x5b, 0x4f, 0x66, 0x6d, 0x7d, 0x07, 0x7f, 0x6f };
  const int w = 42, h = 76, t = 9, half = h / 2;
  uint8_t mask = masks[constrain(digit, 0, 9)];
  if (mask & 0x01) tft.fillRoundRect(x + t, y, w - t * 2, t, 3, color);
  if (mask & 0x02) tft.fillRoundRect(x + w - t, y + t, t, half - t, 3, color);
  if (mask & 0x04) tft.fillRoundRect(x + w - t, y + half, t, half - t, 3, color);
  if (mask & 0x08) tft.fillRoundRect(x + t, y + h - t, w - t * 2, t, 3, color);
  if (mask & 0x10) tft.fillRoundRect(x, y + half, t, half - t, 3, color);
  if (mask & 0x20) tft.fillRoundRect(x, y + t, t, half - t, 3, color);
  if (mask & 0x40) tft.fillRoundRect(x + t, y + half - t / 2, w - t * 2, t, 3, color);
}

void drawScreenSaver(bool force) {
  uint32_t utc = currentBridgeUtc();
  if (force) {
    tft.fillScreen(TFT_BLACK);
    screenSaverOldX = -1;
    screenSaverLastTick = -1;
  }
  if (utc == 0) {
    if (screenSaverOldX < 0) {
      tft.setTextDatum(MC_DATUM);
      tft.setTextColor(TFT_DARKGREY, TFT_BLACK);
      tft.drawString("AI CLOCK", SCREEN_W / 2, SCREEN_H / 2, 4);
      screenSaverOldX = 0;
    }
    return;
  }

  int year, month, day, hour, minute, second, weekday;
  int offset = bridgeEpochUtc > 0 ? bridgeUtcOffsetS : weatherStatus.utcOffsetS;
  epochToLocal(utc, offset, year, month, day, hour, minute, second, weekday);
  long refreshTick = utc / 5;
  if (!force && refreshTick == screenSaverLastTick) return;

  char dateBuf[6];
  snprintf(dateBuf, sizeof(dateBuf), "%02d-%02d", month, day);
  tft.setTextDatum(TL_DATUM);
  const int dateFont = 4;
  int dateW = tft.textWidth(dateBuf, dateFont);
  const int weekdayW = 38;
  const int dateLineW = dateW + 8 + weekdayW;
  const int timeW = 204;
  int groupW = max(timeW, dateLineW);
  int groupH = 112;
  int rangeX = max(1, SCREEN_W - groupW - 12);
  int rangeY = max(1, SCREEN_H - groupH - 24);
  uint32_t motionTick = utc / 5;
  int phaseX = (motionTick * 2) % (rangeX * 2);
  int phaseY = motionTick % (rangeY * 2);
  int x = 6 + (phaseX <= rangeX ? phaseX : rangeX * 2 - phaseX);
  int y = 12 + (phaseY <= rangeY ? phaseY : rangeY * 2 - phaseY);

  if (screenSaverOldX >= 0)
    tft.fillRect(screenSaverOldX - 2, screenSaverOldY - 2, screenSaverOldW + 4, screenSaverOldH + 4, TFT_BLACK);
  int timeX = x + (groupW - timeW) / 2;
  const int digitX[] = { timeX, timeX + 47, timeX + 115, timeX + 162 };
  const int digitValue[] = { hour / 10, hour % 10, minute / 10, minute % 10 };
  for (int i = 0; i < 4; i++) drawScreenSaverDigit(digitValue[i], digitX[i], y, TFT_CYAN);
  // Exact centre of the 26px gap between the hour and minute groups, and
  // vertically symmetric around the 76px digit centre (y + 38).
  tft.fillCircle(timeX + 102, y + 26, 5, TFT_CYAN);
  tft.fillCircle(timeX + 102, y + 50, 5, TFT_CYAN);
  tft.setTextColor(TFT_DARKGREY, TFT_BLACK);
  // Centre the date under the actually lit clock, not the four fixed digit
  // cells. From 10:00-19:59 the leading "1" starts 33px inside its cell,
  // which otherwise makes the visible clock look right-shifted.
  int firstDigitVisibleLeft = hour / 10 == 1 ? 33 : 0;
  int timeVisibleCenter = timeX + (firstDigitVisibleLeft + timeW) / 2;
  int dateX = timeVisibleCenter - dateLineW / 2;
  tft.drawString(dateBuf, dateX, y + 80, dateFont);
  int weekdayX = dateX + dateW + 8;
  drawWeekdayGlyph(0, weekdayX, y + 84, TFT_DARKGREY);
  drawWeekdayGlyph(weekday + 1, weekdayX + 20, y + 84, TFT_DARKGREY);
  screenSaverOldX = x;
  screenSaverOldY = y;
  screenSaverOldW = groupW;
  screenSaverOldH = groupH;
  screenSaverLastTick = refreshTick;
}

void drawWeatherDigit(int digit, int x, int y, uint16_t color) {
  static const uint8_t masks[10] = { 0x3f, 0x06, 0x5b, 0x4f, 0x66, 0x6d, 0x7d, 0x07, 0x7f, 0x6f };
  const int w = 16, h = 30, t = 3, half = h / 2;
  uint8_t mask = masks[constrain(digit, 0, 9)];
  if (mask & 0x01) tft.fillRoundRect(x + t, y, w - t * 2, t, 1, color);
  if (mask & 0x02) tft.fillRoundRect(x + w - t, y + t, t, half - t, 1, color);
  if (mask & 0x04) tft.fillRoundRect(x + w - t, y + half, t, half - t, 1, color);
  if (mask & 0x08) tft.fillRoundRect(x + t, y + h - t, w - t * 2, t, 1, color);
  if (mask & 0x10) tft.fillRoundRect(x, y + half, t, half - t, 1, color);
  if (mask & 0x20) tft.fillRoundRect(x, y + t, t, half - t, 1, color);
  if (mask & 0x40) tft.fillRoundRect(x + t, y + half - 1, w - t * 2, t, 1, color);
}

void drawWeatherClock() {
  if (!weatherStatus.loaded) return;
  uint32_t utc = weatherStatus.epochUtc + (millis() - weatherSyncMs) / 1000;
  int year, month, day, hour, minute, second, weekday;
  epochToLocal(utc, weatherStatus.utcOffsetS, year, month, day, hour, minute, second, weekday);
  String hourText = String(hour < 10 ? "0" : "") + String(hour);
  String minuteText = String(minute < 10 ? "0" : "") + String(minute);
  const int hourMinuteGap = 10;
  const int secondGap = 8;
  const int secondDigitStep = 20;
  const int secondWidth = 36;
  int hourWidth = tft.textWidth(hourText, 7);
  int minuteWidth = tft.textWidth(minuteText, 7);
  int hourMinuteWidth = hourWidth + hourMinuteGap + minuteWidth;
  int groupWidth = hourMinuteWidth + secondGap + secondWidth;
  // Font 7 has more visible side-bearing on the left than the hand-drawn
  // seconds have on the right, so geometric centring looks right-heavy.
  const int visualCenterOffset = -4;
  int timeX = (SCREEN_W - groupWidth) / 2 + visualCenterOffset;
  int secondX = timeX + hourMinuteWidth + secondGap;
  if (hour != weatherLastHour || minute != weatherLastMinute) {
    tft.fillRect(0, 52, SCREEN_W, 68, TFT_BLACK);
    tft.setTextDatum(TL_DATUM);
    tft.setTextColor(TFT_WHITE, TFT_BLACK);
    tft.drawString(hourText, timeX, 57, 7);
    tft.setTextColor(TFT_ORANGE, TFT_BLACK);
    tft.drawString(minuteText, timeX + hourWidth + hourMinuteGap, 57, 7);
    weatherLastHour = hour;
    weatherLastMinute = minute;
    weatherLastSecond = -1;
  }
  if (second != weatherLastSecond) {
    tft.fillRect(secondX - 2, 70, secondWidth + 4, 39, TFT_BLACK);
    drawWeatherDigit(second / 10, secondX, 75, TFT_LIGHTGREY);
    drawWeatherDigit(second % 10, secondX + secondDigitStep, 75, TFT_LIGHTGREY);
    weatherLastSecond = second;
  }
  int stale = weatherStatus.stale ? 1 : 0;
  if (stale != weatherLastStale) {
    tft.fillRect(232, 39, 7, 7, TFT_BLACK);
    weatherLastStale = stale;
  }
}

