yaoyouzhong/esp8266-ai/firmware/src/main.cpp
  html += "<form method='POST' action='/reset-wifi' onsubmit=\"return confirm('清除 WiFi "
          "设置并重启？设备会开启配网热点。');\">";
  html += "<button type='submit' style='background:#dc2626'>重置 WiFi</button>";
  html += "</form>";

  html += "</body></html>";
  webServer.send(200, "text/html", html);
}

void handleSave() {
  String newHost = webServer.arg("bridge");
  newHost.trim();
  bridgeHost = newHost;
  saveBridgeHost(bridgeHost);
  Serial.printf("[web] bridge host updated to '%s'\n", bridgeHost.c_str());
  webServer.sendHeader("Location", "/");
  webServer.send(303);
}

// ---------- JSON API for the Mac app ----------

const char *displayModeName(DisplayMode m) {
  if (m == MODE_CLAUDE) return "claude";
  if (m == MODE_CODEX) return "codex";
  if (m == MODE_DUAL) return "dual";
  if (m == MODE_DOMESTIC) return "domestic";
  if (m == MODE_NET) return "net";
  if (m == MODE_MUSIC) return "music";
  if (m == MODE_STOCK) return "stock";
  if (m == MODE_WEATHER) return "weather";
  if (m == MODE_SCREENSAVER) return "screensaver";
  return "auto";
}

uint32_t crc32Update(uint32_t crc, const uint8_t *data, size_t length);

uint32_t cachedFileCrc(const char *path) {
  File file = LittleFS.open(path, "r");
  if (!file) return 0;
  uint32_t crc = 0xffffffff;
  uint8_t buffer[128];
  while (file.available()) {
    int count = file.read(buffer, sizeof(buffer));
    if (count <= 0) { file.close(); return 0; }
    crc = crc32Update(crc, buffer, count);
  }
  file.close();
  return crc ^ 0xffffffff;
}

String deviceInfoJson() {
  JsonDocument doc;
  doc["ip"] = WiFi.localIP().toString();
  doc["ssid"] = WiFi.SSID();
  doc["bridge"] = bridgeHost;
  doc["mode"] = displayModeName(displayMode);           // configured mode
  doc["effective"] = displayModeName(effectiveMode());   // what's on screen now
  doc["music_playing"] = statusMusicPlaying;
  doc["showing"] = (currentApp == APP_CLAUDE) ? "claude" : "codex";
  doc["last_update_s"] = everPolled ? (long)((millis() - lastSuccessMs) / 1000) : -1;
  doc["sprite_rev"] = spriteRev;
  doc["brightness"] = brightness;
  doc["fw"] = FW_VERSION;
  JsonObject cache = doc["ui_cache"].to<JsonObject>();
  cache["stock"] = LittleFS.exists(STOCK_UI_CACHE_FILE);
  cache["weather"] = LittleFS.exists(WEATHER_UI_CACHE_FILE);
  cache["stock_crc"] = cachedFileCrc(STOCK_UI_CACHE_FILE);
  cache["weather_crc"] = cachedFileCrc(WEATHER_UI_CACHE_FILE);
  JsonObject c = doc["claude"].to<JsonObject>();
  c["plan"] = claudeStatus.plan;
  c["status"] = claudeStatus.status;
  c["custom_sprite"] = claudeCustom;
  c["w"] = CLAUDE_SPRITE_W;
  c["h"] = CLAUDE_SPRITE_H;
  JsonObject x = doc["codex"].to<JsonObject>();
  x["plan"] = codexStatus.plan;
  x["status"] = codexStatus.status;
  x["custom_sprite"] = codexCustom;
  x["w"] = CODEX_SPRITE_W;
  x["h"] = CODEX_SPRITE_H;
  String out;
  serializeJson(doc, out);
  return out;
}

void handleApiInfo() {
  String out = deviceInfoJson();
  webServer.send(200, "application/json", out);
}

void handleApiDisplay() {
  String mode = webServer.arg("mode");
  screenSaverPreview = mode == "screensaver_preview";
  if (mode == "auto") displayMode = MODE_AUTO;
  else if (mode == "claude") displayMode = MODE_CLAUDE;
  else if (mode == "codex") displayMode = MODE_CODEX;
  else if (mode == "dual") displayMode = MODE_DUAL;
  else if (mode == "domestic") displayMode = MODE_DOMESTIC;
  else if (mode == "net") displayMode = MODE_NET;
  else if (mode == "music") displayMode = MODE_MUSIC;
  else if (mode == "stock") displayMode = MODE_STOCK;
  else if (mode == "weather") displayMode = MODE_WEATHER;
  else if (mode == "screensaver" || mode == "screensaver_preview") displayMode = MODE_SCREENSAVER;
  else {
    screenSaverPreview = false;
    webServer.send(400, "text/plain", "mode must be auto|claude|codex|dual|domestic|net|music|stock|weather|screensaver");
    return;
  }
  Serial.printf("[api] display mode = %s\n", mode.c_str());
  lastEffectiveMode = effectiveMode();
  if (displayMode == MODE_NET) {
    netChromeDrawn = false;
    lastNetPollMs = 0; // poll + draw on the next loop tick
  } else if (displayMode == MODE_MUSIC) {
    musicChromeDrawn = false;
    lastMusicPollMs = 0; // poll + draw on the next loop tick
  } else if (displayMode == MODE_DUAL) {
    drawDualScreen(true);
  } else if (displayMode == MODE_DOMESTIC) {
    drawDomesticScreen(true);
  } else if (displayMode == MODE_STOCK) {
    lastStockPollMs = 0;
    drawStockCachedOrLoading();
  } else if (displayMode == MODE_WEATHER) {
    lastWeatherPollMs = 0;
    drawWeatherCachedOrLoading();
  } else if (displayMode == MODE_SCREENSAVER) {
    drawScreenSaver(true);
  } else {
    updateActiveApp();
    drawActiveApp(); // unconditional: also repaints over a previous net chart
  }
  webServer.send(200, "text/plain", "ok");
}

void handleApiBrightness() {
  String levelArg = webServer.arg("level");
  if (levelArg.length() == 0) {
    webServer.send(400, "text/plain", "missing level (0-100)");
    return;
  }
  int level = levelArg.toInt();
  if (level < 0) level = 0;
  if (level > 100) level = 100;
  brightness = level;
  applyBrightness();
  saveBrightness();
  Serial.printf("[api] brightness = %d\n", brightness);
  webServer.send(200, "text/plain", "ok");
}

void sendUsbFrame(const char *type, const String &data = "") {
  Serial.print(USB_FRAME_PREFIX);
  Serial.print("{\"type\":\"");
  Serial.print(type);
  Serial.print("\",\"version\":1");
  if (data.length()) {
    Serial.print(",\"data\":");
    Serial.print(data);
  }
  Serial.println("}");
}

uint32_t crc32Update(uint32_t crc, const uint8_t *data, size_t length) {
  while (length--) {
    crc ^= *data++;
    for (int bit = 0; bit < 8; bit++)
      crc = (crc & 1) ? (crc >> 1) ^ 0xedb88320UL : crc >> 1;
  }
  return crc;
}

void sendBinaryAck(uint16_t transfer, int seq, const char *stage, bool ok, const char *reason = "") {
  JsonDocument doc;
  doc["type"] = "binary_ack";
  doc["version"] = 1;
  doc["transfer"] = transfer;
  doc["seq"] = seq;
  doc["stage"] = stage;
  doc["ok"] = ok;
  if (reason[0]) doc["reason"] = reason;
  Serial.print(USB_FRAME_PREFIX);
  serializeJson(doc, Serial);
  Serial.println();
}

size_t cobsDecode(const uint8_t *input, size_t length, uint8_t *output, size_t capacity) {
  size_t read = 0, write = 0;
  while (read < length) {
    uint8_t code = input[read++];
    if (code == 0 || read + code - 1 > length) return 0;
    for (uint8_t i = 1; i < code; i++) {
      if (write >= capacity) return 0;
      output[write++] = input[read++];
    }
    if (code != 0xff && read < length) {
      if (write >= capacity) return 0;
      output[write++] = 0;
    }
  }
  return write;
}

size_t cobsEncode(const uint8_t *input, size_t length, uint8_t *output, size_t capacity) {
  size_t read = 0, write = 1, codeAt = 0;
  uint8_t code = 1;
  while (read < length) {
    if (input[read] == 0) {
      if (codeAt >= capacity || write >= capacity) return 0;
      output[codeAt] = code; codeAt = write++; code = 1; read++;
    } else {
      if (write >= capacity) return 0;
      output[write++] = input[read++];
      if (++code == 0xff) {
        if (codeAt >= capacity || write >= capacity) return 0;
        output[codeAt] = code; codeAt = write++; code = 1;
      }
    }
  }
  if (codeAt >= capacity) return 0;
  output[codeAt] = code;
  return write;
}

void cancelUsbBlob() {
  if (usbBlob.file) usbBlob.file.close();
  usbBlob.active = false;
  usbBlob.kind = USB_BLOB_NONE;
}

void beginUsbBlob(JsonDocument &doc) {
  cancelUsbBlob();
  String kind = doc["kind"] | "";
  if (kind == "music_cover") usbBlob.kind = USB_MUSIC_COVER;
  else if (kind == "music_text") usbBlob.kind = USB_MUSIC_TEXT;
  else if (kind == "stock_names") usbBlob.kind = USB_STOCK_NAMES;
  else if (kind == "stock_names_rle") usbBlob.kind = USB_STOCK_NAMES_RLE;
  else if (kind == "weather_header") usbBlob.kind = USB_WEATHER_HEADER;
  else if (kind == "weather_date") usbBlob.kind = USB_WEATHER_DATE;
  else if (kind == "weather_air") usbBlob.kind = USB_WEATHER_AIR;
  else if (kind == "weather_labels") usbBlob.kind = USB_WEATHER_LABELS;
  else if (kind == "weather_labels_rle") usbBlob.kind = USB_WEATHER_LABELS_RLE;
  else if (kind == "gif_claude") usbBlob.kind = USB_GIF_CLAUDE;
  else if (kind == "gif_codex") usbBlob.kind = USB_GIF_CODEX;
  usbBlob.transfer = doc["transfer"] | 0;
  usbBlob.expectedSize = doc["size"] | 0UL;
  usbBlob.expectedCrc = doc["crc32"] | 0UL;
  usbBlob.width = doc["width"] | 0;
  usbBlob.height = doc["height"] | 0;
  usbBlob.nextSeq = 0; usbBlob.received = 0; usbBlob.crc = 0xffffffff;
  usbBlob.rowFill = 0; usbBlob.rowIndex = 0;

