yaoyouzhong/esp8266-ai/firmware/src/main.cpp
  bool ok = usbBlob.kind != USB_BLOB_NONE && usbBlob.expectedSize > 0;
  if (usbBlob.kind == USB_MUSIC_COVER)
    ok = ok && usbBlob.width == MUSIC_COVER_W && usbBlob.height == MUSIC_COVER_H
      && usbBlob.expectedSize == (uint32_t)MUSIC_COVER_W * MUSIC_COVER_H * 2;
  if (usbBlob.kind == USB_MUSIC_TEXT)
    ok = ok && usbBlob.width == MUSIC_TEXT_W && usbBlob.height == MUSIC_TEXT_H
      && usbBlob.expectedSize == (uint32_t)MUSIC_TEXT_W * MUSIC_TEXT_H * 2;
  if (usbBlob.kind == USB_STOCK_NAMES)
    ok = ok && usbBlob.width == STOCK_NAME_W && usbBlob.height == STOCK_NAME_H * MAX_STOCKS
      && usbBlob.expectedSize == (uint32_t)STOCK_NAME_W * STOCK_NAME_H * MAX_STOCKS * 2;
  if (usbBlob.kind == USB_STOCK_NAMES_RLE)
    ok = ok && usbBlob.width == STOCK_NAME_W && usbBlob.height == STOCK_NAME_H * MAX_STOCKS
      && usbBlob.expectedSize <= (uint32_t)STOCK_NAME_W * STOCK_NAME_H * MAX_STOCKS * 2;
  if (usbBlob.kind == USB_WEATHER_HEADER)
    ok = ok && usbBlob.width == WEATHER_HEADER_W && usbBlob.height == WEATHER_HEADER_H
      && usbBlob.expectedSize == (uint32_t)WEATHER_HEADER_W * WEATHER_HEADER_H * 2;
  if (usbBlob.kind == USB_WEATHER_DATE)
    ok = ok && usbBlob.width == WEATHER_DATE_W && usbBlob.height == WEATHER_DATE_H
      && usbBlob.expectedSize == (uint32_t)WEATHER_DATE_W * WEATHER_DATE_H * 2;
  if (usbBlob.kind == USB_WEATHER_AIR)
    ok = ok && usbBlob.width == WEATHER_AIR_W && usbBlob.height == WEATHER_AIR_H
      && usbBlob.expectedSize == (uint32_t)WEATHER_AIR_W * WEATHER_AIR_H * 2;
  if (usbBlob.kind == USB_WEATHER_LABELS)
    ok = ok && usbBlob.expectedSize == (uint32_t)WEATHER_HEADER_W * WEATHER_HEADER_H * 2
      + (uint32_t)WEATHER_DATE_W * WEATHER_DATE_H * 2
      + (uint32_t)WEATHER_AIR_W * WEATHER_AIR_H * 2;
  if (usbBlob.kind == USB_WEATHER_LABELS_RLE)
    ok = ok && usbBlob.expectedSize <= (uint32_t)WEATHER_HEADER_W * WEATHER_HEADER_H * 2
      + (uint32_t)WEATHER_DATE_W * WEATHER_DATE_H * 2
      + (uint32_t)WEATHER_AIR_W * WEATHER_AIR_H * 2;
  if (usbBlob.kind == USB_STOCK_NAMES || usbBlob.kind == USB_STOCK_NAMES_RLE
      || usbBlob.kind == USB_WEATHER_LABELS || usbBlob.kind == USB_WEATHER_LABELS_RLE) {
    LittleFS.remove(USB_UI_TEMP_FILE);
    usbBlob.file = LittleFS.open(USB_UI_TEMP_FILE, "w");
    ok = ok && (bool)usbBlob.file;
  }
  if (usbBlob.kind == USB_GIF_CLAUDE || usbBlob.kind == USB_GIF_CODEX) {
    ok = ok && usbBlob.expectedSize <= 1500000UL;
    const char *path = usbBlob.kind == USB_GIF_CLAUDE ? CLAUDE_GIF_FILE : CODEX_GIF_FILE;
    LittleFS.remove(path);
    usbBlob.file = LittleFS.open(path, "w");
    ok = ok && (bool)usbBlob.file;
  }
  usbBlob.active = ok;
  sendBinaryAck(usbBlob.transfer, -1, "begin", ok);
}

void handleUsbBinaryFrame(const uint8_t *encoded, size_t encodedLen) {
  uint8_t frame[524];
  size_t frameLen = cobsDecode(encoded, encodedLen, frame, sizeof(frame));
  if (frameLen < 12 || frame[0] != 1 || frame[1] != 1) return;
  uint16_t transfer = frame[2] | ((uint16_t)frame[3] << 8);
  uint16_t seq = frame[4] | ((uint16_t)frame[5] << 8);
  uint16_t length = frame[6] | ((uint16_t)frame[7] << 8);
  if (length > 512 || frameLen != (size_t)12 + length) return;
  uint32_t expected = (uint32_t)frame[8 + length]
    | ((uint32_t)frame[9 + length] << 8) | ((uint32_t)frame[10 + length] << 16)
    | ((uint32_t)frame[11 + length] << 24);
  uint32_t actual = crc32Update(0xffffffff, frame, 8 + length) ^ 0xffffffff;
  if (!usbBlob.active || transfer != usbBlob.transfer || seq != usbBlob.nextSeq
      || expected != actual || usbBlob.received + length > usbBlob.expectedSize) {
    sendBinaryAck(transfer, seq, "chunk", false);
    return;
  }
  lastUsbStatusMs = millis();
  everUsbStatus = true;

  const uint8_t *payload = frame + 8;
  usbBlob.crc = crc32Update(usbBlob.crc, payload, length);
  if (usbBlob.file) {
    if (usbBlob.file.write(payload, length) != length) {
      cancelUsbBlob();
      sendBinaryAck(transfer, seq, "chunk", false);
      return;
    }
  } else {
    int rowBytes = usbBlob.width * 2;
    for (uint16_t i = 0; i < length; i++) {
      ((uint8_t *)rowBuf)[usbBlob.rowFill++] = payload[i];
      if (usbBlob.rowFill == rowBytes) {
        if (effectiveMode() == MODE_MUSIC) {
          int x = usbBlob.kind == USB_MUSIC_COVER ? (SCREEN_W - MUSIC_COVER_W) / 2 : MUSIC_TEXT_X;
          int y = usbBlob.kind == USB_MUSIC_COVER ? 14 : MUSIC_TEXT_Y;
          tft.pushImage(x, y + usbBlob.rowIndex, usbBlob.width, 1, rowBuf);
        } else if (effectiveMode() == MODE_STOCK && usbBlob.kind == USB_STOCK_NAMES) {
          int stock = usbBlob.rowIndex / STOCK_NAME_H;
          int row = usbBlob.rowIndex % STOCK_NAME_H;
          if (stock < stockCount) tft.pushImage(70, 6 + stock * 54 + row, STOCK_NAME_W, 1, rowBuf);
        } else if (effectiveMode() == MODE_WEATHER && usbBlob.kind == USB_WEATHER_HEADER) {
          tft.pushImage(weatherHeaderX(), WEATHER_HEADER_Y + usbBlob.rowIndex, WEATHER_HEADER_W, 1, rowBuf);
        } else if (effectiveMode() == MODE_WEATHER && usbBlob.kind == USB_WEATHER_DATE) {
          tft.pushImage(WEATHER_DATE_X, WEATHER_DATE_Y + usbBlob.rowIndex, WEATHER_DATE_W, 1, rowBuf);
        } else if (effectiveMode() == MODE_WEATHER && usbBlob.kind == USB_WEATHER_AIR) {
          tft.pushImage(WEATHER_AIR_X, WEATHER_AIR_Y + usbBlob.rowIndex, WEATHER_AIR_W, 1, rowBuf);
        }
        usbBlob.rowFill = 0;
        usbBlob.rowIndex++;
      }
    }
  }
  usbBlob.received += length;
  usbBlob.nextSeq++;
  sendBinaryAck(transfer, seq, "chunk", true);
}

struct Rle565Reader {
  int remaining = 0;
  bool repeat = false;
  uint8_t hi = 0, lo = 0;
};

bool readUiPixels(File &file, bool compressed, Rle565Reader &rle, uint8_t *output, size_t pixels) {
  if (!compressed) return file.read(output, pixels * 2) == (int)(pixels * 2);
  for (size_t pixel = 0; pixel < pixels; pixel++) {
    if (rle.remaining == 0) {
      int header = file.read();
      if (header < 0) return false;
      rle.repeat = (header & 0x80) != 0;
      rle.remaining = (header & 0x7f) + 1;
      if (rle.repeat) {
        int hi = file.read(), lo = file.read();
        if (hi < 0 || lo < 0) return false;
        rle.hi = hi; rle.lo = lo;
      }
    }
    if (rle.repeat) {
      output[pixel * 2] = rle.hi; output[pixel * 2 + 1] = rle.lo;
    } else {
      int hi = file.read(), lo = file.read();
      if (hi < 0 || lo < 0) return false;
      output[pixel * 2] = hi; output[pixel * 2 + 1] = lo;
    }
    rle.remaining--;
  }
  return true;
}

bool drawBufferedUiBlob(UsbBlobKind kind, const char *path, bool render) {
  File file = LittleFS.open(path, "r");
  if (!file) return false;
  bool ok = true;
  bool compressed = kind == USB_STOCK_NAMES_RLE || kind == USB_WEATHER_LABELS_RLE;
  bool stockBlob = kind == USB_STOCK_NAMES || kind == USB_STOCK_NAMES_RLE;
  Rle565Reader rle;
  if (stockBlob) {
    if (render && effectiveMode() == MODE_STOCK) {
      tft.fillScreen(TFT_BLACK);
      stockChromeDrawn = true;
      stockNamesDrawnRev = stockNamesRev;
      for (int i = 0; i < MAX_STOCKS; i++) { stockLastCode[i] = "\x01"; stockLastValue[i] = "\x01"; }
      drawStockScreen(false);
    }
    for (int stock = 0; stock < MAX_STOCKS && ok; stock++) {
      for (int row = 0; row < STOCK_NAME_H; row++) {
        if (!readUiPixels(file, compressed, rle, (uint8_t *)rowBuf, STOCK_NAME_W)) { ok = false; break; }
        if (render && effectiveMode() == MODE_STOCK && stock < stockCount)
          tft.pushImage(70, 6 + stock * 54 + row, STOCK_NAME_W, 1, rowBuf);
      }
    }
  } else {
    if (render && effectiveMode() == MODE_WEATHER) {
      tft.fillScreen(TFT_BLACK);
      weatherChromeDrawn = true;
      weatherTextDrawnRev = weatherStatus.textRev;
      weatherLastHour = weatherLastMinute = weatherLastSecond = weatherLastStale = -1;
      drawWeatherScreen(false);
    }
    for (int row = 0; row < WEATHER_HEADER_H && ok; row++) {
      if (!readUiPixels(file, compressed, rle, (uint8_t *)rowBuf, WEATHER_HEADER_W)) { ok = false; break; }
      if (render && effectiveMode() == MODE_WEATHER) tft.pushImage(weatherHeaderX(), WEATHER_HEADER_Y + row, WEATHER_HEADER_W, 1, rowBuf);
    }
    for (int row = 0; row < WEATHER_DATE_H && ok; row++) {
      if (!readUiPixels(file, compressed, rle, (uint8_t *)rowBuf, WEATHER_DATE_W)) { ok = false; break; }
      if (render && effectiveMode() == MODE_WEATHER) tft.pushImage(WEATHER_DATE_X, WEATHER_DATE_Y + row, WEATHER_DATE_W, 1, rowBuf);
    }
    for (int row = 0; row < WEATHER_AIR_H && ok; row++) {
      if (!readUiPixels(file, compressed, rle, (uint8_t *)rowBuf, WEATHER_AIR_W)) { ok = false; break; }
      if (render && effectiveMode() == MODE_WEATHER) tft.pushImage(WEATHER_AIR_X, WEATHER_AIR_Y + row, WEATHER_AIR_W, 1, rowBuf);
    }
    // The centered header bitmap overlaps the icon's left edge with black
    // background pixels, so repaint the icon after the atomic label swap.
    if (ok && render && effectiveMode() == MODE_WEATHER) drawWeatherIcon(WEATHER_ICON_X, WEATHER_ICON_Y, weatherStatus.icon);
  }
  if (compressed && (rle.remaining != 0 || file.available())) ok = false;
  file.close();
  return ok;
}

bool promoteUiCache(const char *cachePath) {
  LittleFS.remove(USB_UI_BACKUP_FILE);
  bool hadCache = LittleFS.exists(cachePath);
  if (hadCache && !LittleFS.rename(cachePath, USB_UI_BACKUP_FILE)) return false;
  if (LittleFS.rename(USB_UI_TEMP_FILE, cachePath)) {
    LittleFS.remove(USB_UI_BACKUP_FILE);
    return true;
  }
  if (hadCache) LittleFS.rename(USB_UI_BACKUP_FILE, cachePath);
  return false;
}

