yaoyouzhong/esp8266-ai/firmware/src/main.cpp
void drawStockCachedOrLoading() {
  if (drawBufferedUiBlob(USB_STOCK_NAMES_RLE, STOCK_UI_CACHE_FILE, true)) return;
  tft.fillScreen(TFT_BLACK); stockChromeDrawn = true;
  tft.setTextDatum(TC_DATUM); tft.setTextColor(TFT_DARKGREY, TFT_BLACK);
  tft.drawString("Loading stocks...", SCREEN_CX, 108, 2);
}

void drawWeatherCachedOrLoading() {
  if (drawBufferedUiBlob(USB_WEATHER_LABELS_RLE, WEATHER_UI_CACHE_FILE, true)) return;
  tft.fillScreen(TFT_BLACK); weatherChromeDrawn = true;
  tft.setTextDatum(TC_DATUM); tft.setTextColor(TFT_DARKGREY, TFT_BLACK);
  tft.drawString("Loading weather...", SCREEN_CX, 108, 2);
}

void finishUsbBlob(uint16_t transfer) {
  if (!usbBlob.active || transfer != usbBlob.transfer) {
    sendBinaryAck(transfer, usbBlob.nextSeq, "end", false);
    return;
  }
  if (usbBlob.file) usbBlob.file.close();
  const char *reason = "";
  bool ok = usbBlob.received == usbBlob.expectedSize;
  if (!ok) reason = "size";
  if (ok && (usbBlob.crc ^ 0xffffffff) != usbBlob.expectedCrc) { ok = false; reason = "crc"; }
  if (ok && usbBlob.rowFill != 0) { ok = false; reason = "row"; }
  bool uiBlob = usbBlob.kind == USB_STOCK_NAMES || usbBlob.kind == USB_STOCK_NAMES_RLE
    || usbBlob.kind == USB_WEATHER_LABELS || usbBlob.kind == USB_WEATHER_LABELS_RLE;
  if (ok && uiBlob) {
    ok = drawBufferedUiBlob(usbBlob.kind, USB_UI_TEMP_FILE, false);
    if (!ok) reason = "decode";
    bool cacheable = usbBlob.kind == USB_STOCK_NAMES_RLE || usbBlob.kind == USB_WEATHER_LABELS_RLE;
    const char *cachePath = usbBlob.kind == USB_STOCK_NAMES_RLE ? STOCK_UI_CACHE_FILE : WEATHER_UI_CACHE_FILE;
    if (ok && cacheable && !promoteUiCache(cachePath)) { ok = false; reason = "cache"; }
    if (ok && cacheable) ok = drawBufferedUiBlob(usbBlob.kind, cachePath, true);
    else if (ok) ok = drawBufferedUiBlob(usbBlob.kind, USB_UI_TEMP_FILE, true);
    if (!ok && !reason[0]) reason = "draw";
    LittleFS.remove(USB_UI_TEMP_FILE);
  } else if (uiBlob) {
    LittleFS.remove(USB_UI_TEMP_FILE);
  }
  if (ok && (usbBlob.kind == USB_GIF_CLAUDE || usbBlob.kind == USB_GIF_CODEX)) {
    ActiveApp slot = usbBlob.kind == USB_GIF_CLAUDE ? APP_CLAUDE : APP_CODEX;
    const char *gifPath = slot == APP_CLAUDE ? CLAUDE_GIF_FILE : CODEX_GIF_FILE;
    const char *binPath = slot == APP_CLAUDE ? CLAUDE_SPRITE_FILE : CODEX_SPRITE_FILE;
    int tw = slot == APP_CLAUDE ? CLAUDE_SPRITE_W : CODEX_SPRITE_W;
    int th = slot == APP_CLAUDE ? CLAUDE_SPRITE_H : CODEX_SPRITE_H;
    ok = decodeGifToBin(gifPath, binPath, tw, th);
    if (!ok) reason = "decode";
    LittleFS.remove(gifPath);
    if (ok) {
      spriteRev++;
      loadCustomSpriteState();
      if (slot == APP_CLAUDE) claudeFrame = 0; else codexFrame = 0;
      if (currentApp == slot) drawActiveApp();
    }
  }
  uint16_t seq = usbBlob.nextSeq;
  cancelUsbBlob();
  sendBinaryAck(transfer, seq, "end", ok, reason);
}

void writeUsbBinaryFrame(uint16_t transfer, uint16_t seq, const uint8_t *payload, uint16_t length) {
  uint8_t frame[524], encoded[528];
  frame[0] = 1; frame[1] = 1;
  frame[2] = transfer; frame[3] = transfer >> 8;
  frame[4] = seq; frame[5] = seq >> 8;
  frame[6] = length; frame[7] = length >> 8;
  memcpy(frame + 8, payload, length);
  uint32_t crc = crc32Update(0xffffffff, frame, 8 + length) ^ 0xffffffff;
  frame[8 + length] = crc; frame[9 + length] = crc >> 8;
  frame[10 + length] = crc >> 16; frame[11 + length] = crc >> 24;
  size_t encodedLen = cobsEncode(frame, 12 + length, encoded, sizeof(encoded));
  if (!encodedLen) return;
  Serial.write((uint8_t)0);
  Serial.write(encoded, encodedLen);
  Serial.write((uint8_t)0);
}

uint8_t builtinSpriteByte(ActiveApp slot, size_t offset) {
  int frames = slot == APP_CLAUDE ? CLAUDE_SPRITE_FRAMES : CODEX_SPRITE_FRAMES;
  if (offset == 0) return (uint8_t)frames;
  int w = slot == APP_CLAUDE ? CLAUDE_SPRITE_W : CODEX_SPRITE_W;
  int h = slot == APP_CLAUDE ? CLAUDE_SPRITE_H : CODEX_SPRITE_H;
  size_t frameBytes = (size_t)w * h * 2;
  size_t pixelOffset = offset - 1;
  int frame = pixelOffset / frameBytes;
  size_t within = pixelOffset % frameBytes;
  const uint16_t *const *arr = slot == APP_CLAUDE ? claude_sprite_frames : codex_sprite_frames;
  return pgm_read_byte(((const uint8_t *)arr[frame]) + within);
}

void sendSpriteUsb(ActiveApp slot, uint16_t transfer) {
  bool custom = slot == APP_CLAUDE ? claudeCustom : codexCustom;
  const char *path = slot == APP_CLAUDE ? CLAUDE_SPRITE_FILE : CODEX_SPRITE_FILE;
  int w = slot == APP_CLAUDE ? CLAUDE_SPRITE_W : CODEX_SPRITE_W;
  int h = slot == APP_CLAUDE ? CLAUDE_SPRITE_H : CODEX_SPRITE_H;
  int frames = slot == APP_CLAUDE ? claudeFrameCount() : codexFrameCount();
  size_t size = 1 + (size_t)frames * w * h * 2;
  uint32_t crc = 0xffffffff;
  File file;
  uint8_t buf[512];
  if (custom) {
    file = LittleFS.open(path, "r");
    if (!file) return;
    size = file.size();
    while (file.available()) {
      int n = file.read(buf, sizeof(buf));
      if (n > 0) crc = crc32Update(crc, buf, n);
    }
    file.seek(0);
  } else {
    for (size_t offset = 0; offset < size; offset++) {
      uint8_t value = builtinSpriteByte(slot, offset);
      crc = crc32Update(crc, &value, 1);
    }
  }
  crc ^= 0xffffffff;

  JsonDocument begin;
  begin["type"] = "binary_begin"; begin["version"] = 1;
  begin["direction"] = "device"; begin["kind"] = "sprite";
  begin["transfer"] = transfer; begin["size"] = size; begin["crc32"] = crc;
  Serial.print(USB_FRAME_PREFIX); serializeJson(begin, Serial); Serial.println();

  uint16_t seq = 0;
  for (size_t offset = 0; offset < size; offset += sizeof(buf), seq++) {
    int n = min((size_t)sizeof(buf), size - offset);
    if (custom) n = file.read(buf, n);
    else for (int i = 0; i < n; i++) buf[i] = builtinSpriteByte(slot, offset + i);
    if (n <= 0) break;
    writeUsbBinaryFrame(transfer, seq, buf, n);
    yield();
  }
  if (file) file.close();
  JsonDocument end;
  end["type"] = "binary_end"; end["version"] = 1;
  end["direction"] = "device"; end["transfer"] = transfer;
  Serial.print(USB_FRAME_PREFIX); serializeJson(end, Serial); Serial.println();
}

