yaoyouzhong/esp8266-ai/firmware/src/main.cpp
void applyUsbDisplayMode(const String &mode) {
  screenSaverPreview = mode == "screensaver_preview";
  if (mode == "auto") displayMode = MODE_AUTO;
  else if (mode == "claude") displayMode = MODE_CLAUDE;
  else if (mode == "codex") displayMode = MODE_CODEX;
  else if (mode == "dual") displayMode = MODE_DUAL;
  else if (mode == "domestic") displayMode = MODE_DOMESTIC;
  else if (mode == "net") displayMode = MODE_NET;
  else if (mode == "music") displayMode = MODE_MUSIC;
  else if (mode == "stock") displayMode = MODE_STOCK;
  else if (mode == "weather") displayMode = MODE_WEATHER;
  else if (mode == "screensaver" || mode == "screensaver_preview") displayMode = MODE_SCREENSAVER;
  else { screenSaverPreview = false; return; }
  lastEffectiveMode = effectiveMode();
  if (displayMode == MODE_NET) {
    // Initialise synchronously so a net frame sent immediately after the
    // set_display command is not discarded by the first draw tick.
    resetNetChart();
    drawNetChrome();
    netChromeDrawn = true;
    netHeaderDirty = true;
    lastNetDrawMs = millis();
    lastNetPollMs = 0;
  } else if (displayMode == MODE_MUSIC) {
    musicChromeDrawn = false;
    lastMusicPollMs = 0;
  } else if (displayMode == MODE_DUAL) {
    drawDualScreen(true);
  } else if (displayMode == MODE_DOMESTIC) {
    drawDomesticScreen(true);
  } else if (displayMode == MODE_STOCK) {
    drawStockCachedOrLoading();
  } else if (displayMode == MODE_WEATHER) {
    drawWeatherCachedOrLoading();
  } else if (displayMode == MODE_SCREENSAVER) {
    drawScreenSaver(true);
  } else {
    updateActiveApp();
    drawActiveApp();
  }
  sendUsbFrame("info", deviceInfoJson());
}

void handleUsbFrame(const String &json) {
  JsonDocument doc;
  if (deserializeJson(doc, json)) return;
  if ((int)(doc["version"] | 0) != 1) return;
  lastUsbStatusMs = millis();
  everUsbStatus = true;
  String type = doc["type"] | "";
  if (type == "hello") {
    lastUsbStatusMs = millis();
    everUsbStatus = true;
    sendUsbFrame("hello_ack");
    return;
  }
  if (type == "get_info") {
    sendUsbFrame("info", deviceInfoJson());
    return;
  }
  if (type == "status") {
    String payload;
    serializeJson(doc["data"], payload);
    if (parseStatusJson(payload)) {
      lastUsbStatusMs = millis();
      everUsbStatus = true;
      lastSuccessMs = millis();
      everPolled = true;
      DisplayMode eff = effectiveMode();
      if (eff == MODE_DOMESTIC) {
        drawDomesticScreen();
      } else if (eff == MODE_DUAL) {
        drawDualScreen();
      } else if (eff != MODE_NET && eff != MODE_MUSIC && eff != MODE_STOCK
                 && eff != MODE_WEATHER && eff != MODE_SCREENSAVER) {
        if (updateActiveApp()) drawActiveApp();
        else refreshActiveApp();
      }
      sendUsbFrame("status_ack");
    }
    return;
  }
  if (type == "binary_begin") {
    beginUsbBlob(doc);
    return;
  }
  if (type == "binary_end") {
    finishUsbBlob(doc["transfer"] | 0);
    return;
  }
  if (type == "get_sprite_usb") {
    String slot = doc["slot"] | "";
    uint16_t transfer = doc["transfer"] | 0;
    if (slot == "claude") sendSpriteUsb(APP_CLAUDE, transfer);
    else if (slot == "codex") sendSpriteUsb(APP_CODEX, transfer);
    return;
  }
  if (type == "reset_sprite") {
    String slotName = doc["slot"] | "";
    ActiveApp slot = slotName == "claude" ? APP_CLAUDE : APP_CODEX;
    const char *binPath = slot == APP_CLAUDE ? CLAUDE_SPRITE_FILE : CODEX_SPRITE_FILE;
    LittleFS.remove(binPath);
    spriteRev++;
    loadCustomSpriteState();
    if (slot == APP_CLAUDE) claudeFrame = 0; else codexFrame = 0;
    if (currentApp == slot) drawActiveApp();
    sendUsbFrame("info", deviceInfoJson());
    return;
  }
  if (type == "net" && !doc["data"].isNull()) {
    applyNetJson(doc["data"].as<JsonObject>());
    return;
  }
  if (type == "music" && !doc["data"].isNull()) {
    applyMusicJson(doc["data"].as<JsonObject>());
    return;
  }
  if (type == "stock" && !doc["data"].isNull()) {
    applyStockJson(doc["data"].as<JsonObject>());
    if (effectiveMode() == MODE_STOCK) drawStockScreen();
    return;
  }
  if (type == "weather" && !doc["data"].isNull()) {
    applyWeatherJson(doc["data"].as<JsonObject>());
    return;
  }
  if (type == "set_display") {
    applyUsbDisplayMode(doc["mode"] | "");
    return;
  }
  if (type == "set_brightness") {
    int level = doc["level"] | brightness;
    brightness = constrain(level, 0, 100);
    applyBrightness();
    saveBrightness();
    sendUsbFrame("info", deviceInfoJson());
  }
}

void handleUsbSerial() {
  static String line;
  static bool binary = false;
  static uint8_t encoded[528];
  static size_t encodedLen = 0;
  while (Serial.available()) {
    uint8_t value = (uint8_t)Serial.read();
    if (value == 0) {
      if (binary) {
        if (encodedLen) {
          handleUsbBinaryFrame(encoded, encodedLen);
          yield();
        }
        encodedLen = 0;
        binary = false;
      } else {
        line = "";
        binary = true;
      }
      continue;
    }
    if (binary) {
      if (encodedLen < sizeof(encoded)) encoded[encodedLen++] = value;
      else { encodedLen = 0; binary = false; }
      continue;
    }
    char ch = (char)value;
    if (ch == '\n') {
      line.trim();
      if (line.startsWith(USB_FRAME_PREFIX)) {
        handleUsbFrame(line.substring(strlen(USB_FRAME_PREFIX)));
      }
      line = "";
    } else if (ch != '\r') {
      if (line.length() < 2048) line += ch;
      else line = "";
    }
  }
}

void handleApiBridge() {
  String newHost = webServer.arg("host");
  newHost.trim();
  if (newHost.length() == 0) {
    webServer.send(400, "text/plain", "missing host");
    return;
  }
  bridgeHost = newHost;
  saveBridgeHost(bridgeHost);
  Serial.printf("[api] bridge host = '%s'\n", bridgeHost.c_str());
  webServer.send(200, "text/plain", "ok");
  lastPollMs = 0; // poll the new bridge on the next loop tick
}

// Streams the animation currently in use for a slot, in the same wire format
// as the custom .bin: [1 byte frame count][RGB565 frames...]. Lets the Mac
// app mirror exactly what the device is showing (custom upload or built-in).
void handleSpriteRaw(ActiveApp slot) {
  bool custom = (slot == APP_CLAUDE) ? claudeCustom : codexCustom;
  const char *binPath = (slot == APP_CLAUDE) ? CLAUDE_SPRITE_FILE : CODEX_SPRITE_FILE;
  if (custom) {
    File f = LittleFS.open(binPath, "r");
    if (f) {
      webServer.streamFile(f, "application/octet-stream");
      f.close();
      return;
    }
  }
  int frames = (slot == APP_CLAUDE) ? CLAUDE_SPRITE_FRAMES : CODEX_SPRITE_FRAMES;
  int w = (slot == APP_CLAUDE) ? CLAUDE_SPRITE_W : CODEX_SPRITE_W;
  int h = (slot == APP_CLAUDE) ? CLAUDE_SPRITE_H : CODEX_SPRITE_H;
  const uint16_t *const *arr = (slot == APP_CLAUDE) ? claude_sprite_frames : codex_sprite_frames;
  size_t frameBytes = (size_t)w * h * 2;
  webServer.setContentLength(1 + (size_t)frames * frameBytes);
  webServer.send(200, "application/octet-stream", "");
  uint8_t cnt = (uint8_t)frames;
  webServer.sendContent((const char *)&cnt, 1);
  for (int i = 0; i < frames; i++) {
    webServer.sendContent_P((PGM_P)arr[i], frameBytes);
    yield();
  }
}

// Removes a custom sprite so the compiled-in default animation comes back.
void handleSpriteReset(ActiveApp slot) {
  const char *binPath = (slot == APP_CLAUDE) ? CLAUDE_SPRITE_FILE : CODEX_SPRITE_FILE;
  LittleFS.remove(binPath);
  spriteRev++;
  loadCustomSpriteState();
  if (slot == APP_CLAUDE) claudeFrame = 0;
  else codexFrame = 0;
  if (currentApp == slot) drawActiveApp();
  webServer.send(200, "text/plain", "ok");
}

void handleResetWifi() {
  webServer.send(200, "text/html", "<html><body>Resetting WiFi, device will restart...</body></html>");
  delay(200);
  WiFiManager wm;
  wm.resetSettings();
  ESP.restart();
}

// ---------- on-device GIF decode (AnimatedGIF) ----------
// AnimatedGIF hands us the image one horizontal line at a time (via the draw
// callback) at the GIF's native resolution, so we never need a full-canvas
// buffer. We nearest-neighbour rescale into the target slot size and stream the
// result straight to the .bin one target row at a time. Because the .bin can't
// hold a whole frame in RAM to composite against, GIFs that only re-encode a
// changed sub-rectangle (the common optimizer output, disposal method 1) are
// composited by reading the *previous frame's* rows back out of the .bin we're
// writing. (Disposal method 2 "restore to background" isn't distinguished -
// uncovered pixels keep the previous frame instead of clearing; fine for the
// looping character animations this is for.)

struct GifDecodeCtx {
  int canvasW, canvasH; // GIF native size
  int targetW, targetH; // slot size we're rescaling down to
  size_t rowBytes;      // targetW * 2
  File out;             // output .bin, written sequentially
  File prevFile;        // previous frame in the .bin, read sequentially for compositing
  bool hasPrev;         // false for frame 0 (nothing to composite over -> black)
  int producedRow;      // next target row still owed for the current frame
};

static File gifReadFile; // one decode runs at a time, so a single handle is fine

void *gifOpenCB(const char *fname, int32_t *pSize) {
  gifReadFile = LittleFS.open(fname, "r");
  if (!gifReadFile) return nullptr;
  *pSize = (int32_t)gifReadFile.size();
  return (void *)&gifReadFile;
}

void gifCloseCB(void *) {
  if (gifReadFile) gifReadFile.close();
}

int32_t gifReadCB(GIFFILE *pFile, uint8_t *pBuf, int32_t iLen) {
  File *f = (File *)pFile->fHandle;
  // AnimatedGIF's own SD example keeps this one-byte-short guard near EOF.
  if ((pFile->iSize - pFile->iPos) < iLen) iLen = pFile->iSize - pFile->iPos - 1;
  if (iLen <= 0) return 0;
  int32_t n = (int32_t)f->read(pBuf, iLen);
  pFile->iPos = (int32_t)f->position();
  return n;
}

int32_t gifSeekCB(GIFFILE *pFile, int32_t iPosition) {
  File *f = (File *)pFile->fHandle;
  f->seek(iPosition);
  pFile->iPos = iPosition;
  return iPosition;
}

