yaoyouzhong/esp8266-ai/firmware/src/main.cpp
void serviceWiFi() {
  unsigned long nowMs = millis();

  if (WiFi.status() == WL_CONNECTED) {
    wifiDisconnectedSinceMs = 0;
    if (wifiPortalActive) {
      wifiManager.stopConfigPortal();
      wifiPortalActive = false;
    }
    if (!webServerStarted) {
      setupWebServer();
      webServerStarted = true;
      Serial.printf("[wifi] connected ssid=%s ip=%s\n", WiFi.SSID().c_str(),
                    WiFi.localIP().toString().c_str());
    }
    webServer.handleClient();
    return;
  }

  if (wifiDisconnectedSinceMs == 0) wifiDisconnectedSinceMs = nowMs;

  if (wifiPortalActive && usbBridgeActive()) {
    Serial.println("[wifi] USB connected; stopping config portal");
    wifiManager.stopConfigPortal();
    wifiPortalActive = false;
    WiFi.mode(WIFI_STA);
    WiFi.begin();
    lastWifiRetryMs = nowMs;
    drawStaticChrome();
    drawActiveApp();
  }

  // A USB-connected clock must remain fully usable without WiFi. Only expose
  // the provisioning screen when neither transport is available.
  if (!wifiPortalActive && !usbBridgeActive() &&
      nowMs - wifiDisconnectedSinceMs >= WIFI_PORTAL_DELAY_MS) {
    Serial.println("[wifi] no USB or WiFi; starting non-blocking config portal");
    wifiManager.startConfigPortal(WIFI_PORTAL_AP_NAME);
    wifiPortalActive = true;
  }

  if (wifiPortalActive) {
    wifiManager.process();
  } else if (nowMs - lastWifiRetryMs >= WIFI_RETRY_INTERVAL_MS) {
    lastWifiRetryMs = nowMs;
    Serial.println("[wifi] retrying saved network in background");
    WiFi.begin();
  }
}

// ---------- Arduino entry points ----------

void setup() {
  Serial.setRxBufferSize(1024);
  Serial.begin(460800);
  LittleFS.begin();
  loadBridgeHost();
  loadBrightness();
  loadCustomSpriteState();

  tft.init();
  tft.setRotation(0);
  tft.fillScreen(TFT_BLACK);
  analogWriteFreq(BRIGHTNESS_PWM_FREQ);
  analogWriteRange(100); // duty maps 1:1 to a 0-100 percentage
  applyBrightness();

  sendUsbFrame("hello");
  drawStaticChrome();
  drawActiveApp();
  setupWiFi();
  pollBridge();
}

void loop() {
  handleUsbSerial();
  serviceWiFi();
  unsigned long nowMs = millis();

  // Effective mode may differ from the configured one (AUTO -> music while
  // audio plays). On a transition, reset the incoming mode's chrome so it
  // repaints cleanly, and repaint the pet immediately when returning to it.
  DisplayMode eff = effectiveMode();
  if (eff != lastEffectiveMode) {
    lastEffectiveMode = eff;
    if (eff == MODE_NET) {
      netChromeDrawn = false;
      lastNetPollMs = 0;
    } else if (eff == MODE_MUSIC) {
      musicChromeDrawn = false;
      lastMusicPollMs = 0;
    } else if (eff == MODE_DUAL) {
      drawDualScreen(true);
    } else if (eff == MODE_DOMESTIC) {
      drawDomesticScreen(true);
    } else if (eff == MODE_STOCK) {
      lastStockPollMs = 0;
      drawStockCachedOrLoading();
    } else if (eff == MODE_WEATHER) {
      lastWeatherPollMs = 0;
      drawWeatherCachedOrLoading();
    } else if (eff == MODE_SCREENSAVER) {
      drawScreenSaver(true);
    } else {
      updateActiveApp();
      drawActiveApp();
    }
  }

  if (eff == MODE_NET) {
    // net-speed mode: rendering (constant-rate sweep) is independent of the
    // bridge polls that refill its sample queue
    if (nowMs - lastNetDrawMs >= NET_DRAW_INTERVAL_MS) {
      lastNetDrawMs = nowMs;
      netDrawTick();
    }
    if (nowMs - lastNetPollMs >= NET_POLL_INTERVAL_MS) {
      lastNetPollMs = nowMs;
      pollNet();
    }
  } else if (eff == MODE_MUSIC) {
    // music now-playing mode: cover art + track metadata from the bridge
    if (nowMs - lastMusicPollMs >= MUSIC_POLL_INTERVAL_MS) {
      lastMusicPollMs = nowMs;
      pollMusic();
    }
  } else if (eff == MODE_DUAL) {
    // Static page; incoming status frames repaint only changed quota sections.
  } else if (eff == MODE_DOMESTIC) {
    if (nowMs - lastFlashMs >= FLASH_INTERVAL_MS) {
      lastFlashMs = nowMs;
      flashOn = !flashOn;
      if (domesticStatus.needsInput && flashOn) drawFullBorder(TFT_RED);
      else if (domesticStatus.needsInput) drawDomesticScreen(true);
    }
  } else if (eff == MODE_STOCK) {
    if (usbBlob.active && (usbBlob.kind == USB_STOCK_NAMES || usbBlob.kind == USB_STOCK_NAMES_RLE)) return;
    if (nowMs - lastStockPollMs >= STOCK_POLL_INTERVAL_MS) {
      lastStockPollMs = nowMs;
      pollStock();
    }
    if (!stockChromeDrawn || stockDirty) drawStockScreen();
  } else if (eff == MODE_WEATHER) {
    if (usbBlob.active && (usbBlob.kind == USB_WEATHER_LABELS || usbBlob.kind == USB_WEATHER_LABELS_RLE)) return;
    if (nowMs - lastWeatherPollMs >= WEATHER_POLL_INTERVAL_MS) {
      lastWeatherPollMs = nowMs;
      pollWeather();
    }
    if (!weatherChromeDrawn) drawWeatherScreen(true);
    if (nowMs - lastWeatherClockMs >= 1000) {
      lastWeatherClockMs = nowMs;
      drawWeatherClock();
    }
    if (nowMs - lastWeatherAnimMs >= 350) {
      lastWeatherAnimMs = nowMs;
      weatherAnimFrame++;
      drawWeatherAnimation();
    }
  } else if (eff == MODE_SCREENSAVER) {
    drawScreenSaver(false);
  } else {
    // sprite walk-cycle animation (only advances while that app is showing)
    if (nowMs - lastAnimMs >= ANIM_INTERVAL_MS) {
      lastAnimMs = nowMs;
      bool claudeWorking = claudeStatus.status == "working";
      bool codexWorking = codexStatus.status == "working";
      if (showingCd != CD_NONE) {
        // countdown owns the center area: no sprite frames over it
      } else if (currentApp == APP_CLAUDE && claudeWorking) {
        claudeFrame = (claudeFrame + 1) % claudeFrameCount();
        drawClaudeSprite(claudeFrame);
      } else if (currentApp == APP_CODEX && (codexWorking || completionAlertActive())) {
        codexFrame = (codexFrame + 1) % codexFrameCount();
        drawCodexSprite(codexFrame);
      }
    }

    // countdown seconds tick locally between bridge polls
    static unsigned long lastCdTickMs = 0;
    if (showingCd != CD_NONE && nowMs - lastCdTickMs >= 1000) {
      lastCdTickMs = nowMs;
      drawCountdown(false);
    }

    // "urgent" flash toggle (independent, faster cadence)
    if (nowMs - lastFlashMs >= FLASH_INTERVAL_MS) {
      lastFlashMs = nowMs;
      flashOn = !flashOn;
      if (bridgeStale()) {
        redrawRingOnly();
      } else if (currentAppNeedsInput()) {
        // approval needed: blink the whole border red, restore the quota ring
        // on the off-phase so it doesn't erase the normal chrome permanently
        if (flashOn) drawFullBorder(TFT_RED);
        else redrawRingOnly();
      } else if (completionAlertActive()) {
        completionFlashOn = !completionFlashOn;
        if (completionFlashOn) drawFullBorder(TFT_GREEN);
        else redrawRingOnly();
      }
    }

    // alternate which app is shown when neither/both are uniquely working
    if (updateActiveApp()) {
      drawActiveApp();
    }
  }

  // status poll continues in every mode (feeds /api/info and the web page)
  if (nowMs - lastPollMs >= BRIDGE_POLL_INTERVAL_MS) {
    lastPollMs = nowMs;
    pollBridge();
  }
}
